[
    {
        "releaseYear": 2004,
        "age": 0,
        "name": "Counter-Strike: Source",
        "description": "THE NEXT INSTALLMENT OF THE WORLD'S # 1 ONLINE ACTION GAME <br>Counter-Strike: Source blends Counter-Strike's award-winning teamplay action with the advanced technology of Source&trade; technology. Featuring state of the art graphics, all new sounds, and introducing physics, Counter-Strike: Source is a must-have for every action gamer.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/240/header.jpg?t=1602536047",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2004,
        "age": 0,
        "name": "Half-Life: Source",
        "description": "Winner of over 50 Game of the Year awards, Half-Life set new standards for action games when it was released in 1998. Half-Life: Source is a digitally remastered version of the critically acclaimed and best selling PC game, enhanced via Source technology to include physics simulation, enhanced effects, and more.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/280/header.jpg?t=1579630049",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2004,
        "age": 0,
        "name": "Half-Life 2: Deathmatch",
        "description": "Fast multiplayer action set in the Half-Life 2 universe! HL2's physics adds a new dimension to deathmatch play. Play straight deathmatch or try Combine vs. Resistance teamplay. Toss a toilet at your friend today!",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/320/header.jpg?t=1602536087",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2005,
        "age": 0,
        "name": "Half-Life 2: Lost Coast",
        "description": "Originally planned as a section of the Highway 17 chapter of Half-Life 2, Lost Coast is a playable technology showcase that introduces High Dynamic Range lighting to the Source engine.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/340/header.jpg?t=1571757270",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2006,
        "age": 0,
        "name": "Half-Life Deathmatch: Source",
        "description": "Half-Life Deathmatch: Source is a recreation of the first multiplayer game set in the Half-Life universe. Features all the classic weapons and most-played maps, now running on the Source engine.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/360/header.jpg?t=1567240329",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2006,
        "age": 0,
        "name": "Half-Life 2: Episode One",
        "description": "Half-Life 2 has sold over 4 million copies worldwide, and earned over 35 Game of the Year Awards. Episode One is the first in a series of games that reveal the aftermath of Half-Life 2 and launch a journey beyond City 17. Also features two multiplayer games. Half-Life 2 not required.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/380/header.jpg?t=1579628906",
        "developer": "Valve",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2006,
        "age": 0,
        "name": "Garry's Mod",
        "description": "Garry's Mod is a physics sandbox. There aren't any predefined aims or goals. We give you the tools and leave you to play.<br><br>You spawn objects and weld them together to create your own contraptions - whether that's a car, a rocket, a catapult or something that doesn't have a name yet - that's up to you. You can do it offline, or join the thousands of players who play online each day. <br><br>If you're not too great at construction - don't worry! You can place a variety of characters in silly positions. But if you want to do more, we have the means.<h2 class=\"bb_tag\">Beyond the Sandbox</h2><br>The Garry's Mod community is a tremendous source of content and has added hundreds of unique modes to the game. In Trouble In Terrorist Town, you can be a detective solving an online murder as criminals attempt to cover up their homicides. Be a ball, a plant, a chair, or anything else in Prop Hunt's elaborate, shape-shifting game of Hide &amp; Seek. Elevator: Source is gaming's first elevator thrill ride, delivering players to airlocks and kitten dance parties. <br><br>We have one of the most vibrant Steam Community Workshops, with over 300'000 models, maps, and contraptions to download. It has everything from new tools to improve your builds, to guns that fire rainbow-tinged nuclear blasts from space. Take as much or as little as you need: it’s all free. <br><br><strong>Please note: Some multiplayer servers and game-modes might require you to own other games - such as Counter-Strike: Source and Team Fortress 2.</strong>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/4000/header.jpg?t=1617307042",
        "developer": "Facepunch Studios",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": true
        }
    },
    {
        "releaseYear": 2006,
        "age": 0,
        "name": "FlatOut 2™",
        "description": "<strong>DRIVING THIS RECKLESS IS NO ACCIDENT!</strong><br>\t\t\t\t\tBut you might want to cause a few.  In these high-speed races, the more damage you inflict, the better. The ultimate in turbo-charged cars and the craziest competitor drivers are waiting to test your best destructive streak. Responsible drivers need not apply.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Thousands and thousands of objects to annihilate.<br>\t\t\t\t\t</li><li>Mini games gone wild - hurl the driver in these 12 crazy challenges.<br>\t\t\t\t\t</li><li>Wreck your way across parched deserts, massive storm drains and narrow city streets.<br>\t\t\t\t\t</li><li>Ram your opponents' car and watch them fly through the air - you're here to win!</li></ul>FlatOut 2 © 2006 Empire Interactive Europe Ltd. Game concept and development by Bugbear Entertainment Ltd. Empire, FlatOut and &quot;E&quot; are either trademarks or registered trademarks of Empire Interactive Europe Ltd. in the UK/Europe and/or other countries. All rights reserved. NVIDIA, the NVIDIA Logo, GeForce and &quot;The Way It's Meant to be Played&quot; Logo are registered trademarks and/or trademarks of NVIDIA Corporation in the United States and other countries. GameSpy and the &quot;Powered by GameSpy&quot; design are trademarks of GameSpy Industries, Inc. All rights reserved. a product of the e.u.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/2990/header.jpg?t=1570210036",
        "developer": "Bugbear Entertainment",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "FlatOut",
        "description": "FlatOut is adrenaline-filled muscle car racing game packed with explosive physics, spectacular effects and graphics, innovative game play mechanics and good old fun!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Eight players or AI cars on track for close pack racing <br>\t\t\t\t\t</li><li>Single player Career, Quick race and Time trial modes <br>\t\t\t\t\t</li><li>Multiplayer mayhem with up to 8 players <br>\t\t\t\t\t</li><li>16 different fully upgradeable cars <br>\t\t\t\t\t</li><li>48 tracks including stunt arenas and destruction bowls <br>\t\t\t\t\t</li><li>Wacky and funny ragdoll mini-games <br>\t\t\t\t\t</li><li>Open environments for taking your own shortcuts <br>\t\t\t\t\t</li><li>Convincing car handling and impressive damage modeling</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/6220/header.jpg?t=1570209735",
        "developer": "Bugbear Entertainment",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Geometry Wars: Retro Evolved",
        "description": "Geometry Wars: Retro Evolved is a old school style shooter, but remixed for the 21st century with next generation graphics and deep, modern gameplay. Playing is simple: you are a geometric &quot;ship&quot; trapped in a grid world, facing off against waves of deadly wanderers, snakes, and repulsars. Your aim is to survive long enough to set a high score!<br>\t\t\t\t\tAvoid the spawning enemies, and shoot them down for points. You can also fire smart bombs, which destroy all bad guys on the screen. Save these up for when the going gets really tough!<br>\t\t\t\t\tThe more bad guys you kill, the higher your score multiplier goes (2x, 4x, etc.). The higher your multiplier, the more you can score. But don't die, as you lose your multiplier and have to build it up again from scratch!<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Addictive &quot;just one more go&quot; gameplay, with mesmerizing graphics.<br>\t\t\t\t\t</li><li>Pixel perfect recreation of the Xbox Live Arcade game.<br>\t\t\t\t\t</li><li>Support for keyboard, mouse, and dual-stick gamepad play.</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/8400/header.jpg?t=1447351073",
        "developer": "Bizarre Creations",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2016,
        "age": 0,
        "name": "Titan Quest Anniversary Edition",
        "description": "For its 10 year anniversary, Titan Quest will shine in new splendour. This Anniversary Edition combines both Titan Quest and Titan Quest Immortal Throne in one game, and has been given a massive overhaul for the ultimate ARPG experience.<h2 class=\"bb_tag\"><strong>Anniversary Edition update</strong></h2><ul class=\"bb_ul\"><li>Restored and improved multiplayer functionality, including new features like a built-in voice chat and NAT resolving for best multiplayer connectivity<br></li><li>Support for more resolutions, larger camera distance and scaleable UI size<br></li><li>Improved performance and general stability<br></li><li>Support for modders through new modding options and a fully integrated Steam Workshop<br></li><li>Complete balance rework with improvements to all Masteries, damage types, unique items and sets<br></li><li>Countless bug fixes and other improvements, including ten years’ worth of community fixes<br></li><li>Increased challenges and rewards for larger parties and on higher difficulty levels<br></li><li>Dozens of new heroes and bosses to encounter<br></li><li>Improved enemy and pet AI<br></li><li>Quality of life features like higher stack limits, quick item pickup, a larger stash and a speed setting<br></li><li>Reduced cheating with curbed exploits, removal of test items and mod comparison in multiplayer<br></li><li>Steam Friend Invites<br></li><li>Steam Achievements<br></li><li>Steam Trading Cards</li></ul><h2 class=\"bb_tag\"><strong>Discover the Courage that Turns Heroes Into Legends</strong></h2>From Age of Empires co-creator Brian Sullivan and Braveheart writer Randall Wallace comes an innovative action role playing game set in ancient Greece, Egypt and Asia. The Titans have escaped their eternal prison, wreaking havoc upon the earth. The gods seek a hero who can turn the tide in an epic struggle that will determine the fate of both men and gods.<br><br><br>In this epic quest of good versus evil, players will encounter the greatest villains of Greek mythology, brave the attacks of Cerberus, and hazard the banks of the River Styx. Players will interpret the prophecies of the blind seer Tiresias, fight alongside Agamemnon and Achilles, and use the wiles of Odysseus to conquer this dark new adventure.<br><br><strong>Are you ready for the quest?</strong><h2 class=\"bb_tag\"><strong>Key features</strong></h2><ul class=\"bb_ul\"><li>Explore the Ancient World - Unlock arcane mysteries and battle the beasts of mythology as you journey to the Parthenon, Great Pyramids, Hanging Gardens of Babylon, The Great Wall and other legendary locations<br></li><li>Atmospheric Graphics - Take a hero's journey through authentic Ancient World settings crafted in stunning, realistic, 3D detail<br></li><li>Conquer Monsters of Legend - Battle horrific monsters and mythical beasts in a story-driven campaign that will determine the fate of all existence<br></li><li>Highly Customizable Characters - Build and customize your characters with 28 classes and over 1000 pieces of unique and legendary items to create the ultimate champion<br></li><li>Online Multiplayer Gameplay - Challenge others to experience your map creations in fast-action, 2-6 player online cooperative gameplay<br></li><li>Create Your Own Worlds - Create your own maps with the easy-to-use World Editor for endless adventuring</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/475150/header.jpg?t=1638867197",
        "developer": "Iron Lore Entertainment",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Commander Keen",
        "description": "<p><strong>Commander Keen: Invasion of the Vorticons:</strong> </p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Episode 1: Marooned on Mars (Dec. 14th 1990)</li>\n\t\t\t\t\t<li>Episode 2: The Earth Explodes (1991)</li>\n\t\t\t\t\t<li>Episode 3: Keen Must Die! (1991)</li></ul>\n\t\t\t\t\t<p>Commander Keen's very first adventure, and the debut of id's groundbreaking side-scrolling technology. In the game you play the role of Commander Keen: the alter-ego of an eight year-old genius by the name of Billy Blaze. When Billy learns that the Earth is in danger, he dons his brother's football helmet and his homemade interstellar spaceship to become Commander Keen -- Defender of the Earth!</p>\n\t\t\t\t\t<p></p>\n\t\t\t\t\t<p><strong>Commander Keen in Goodbye Galaxy!:</strong> </p>\n\t\t\t\t\t<ul>\n\t\t\t\t\t<li>Episode 4: Secret of the Oracle (1991)</li>\n\t\t\t\t\t<li>Episode 5: The Armageddon Machine (1991)</li></ul>\n\t\t\t\t\t<p>You are eight-year-old Billy Blaze, boy genius to your neighborhood. Commander Keen to the rest of the universe. It's time to grab your trusty pogo stick and neural stunner, climb into the cockpit of your homemade Megarocket and blast off for the Shadowlands. To prevent the obliteration of life as we know it, you'll have to battle your way past deadly hazards and devious creatures, or end up as space toast.</p>\n\t\t\t\t\t<p></p>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/9180/header.jpg?t=1573831376",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Wolfenstein 3D",
        "description": "Maybe it was the fact that people got to blow away Nazis. Maybe it was the sheer challenge of it all. For whatever reason, Wolfenstein 3D and Spear of Destiny, pioneered the first-person shooter genre and brought its legendary creators, id Software, worldwide notoriety and numerous awards. In fact, The Computer Gaming World Hall of Fame recognized Wolfenstein 3D as helping to shape the overall direction of the computer gaming industry.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/2270/header.jpg?t=1573831648",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Spear of Destiny",
        "description": "<p>It's World War II and you are B.J. Blazkowicz, the Allies' most valuable agent. In the midst of the German Blitzkrieg, the Spear that pierced the side of Christ is taken from Versailles by the Nazis and secured in the impregnable Castle Wolfenstein. According to legend, no man can be defeated when he has the Spear. Hitler believes himself to be invincible with the power of the Spear as his brutal army sweeps across Europe. Your mission is to infiltrate the heavily guarded Nazi stronghold and recapture the Spear from an already unbalanced Hitler. The loss of his most coveted weapon could push him over the edge. It could also get you ripped to pieces.</p>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/9000/header.jpg?t=1574196423",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Return to Castle Wolfenstein",
        "description": "World War II rages and nations fall. SS head Himmler has Hitler's full backing to twist science and the occult into an army capable of annihilating the Allies once and for all. Battling alone, you're on an intense mission to pierce the black heart of the Third Reich and stop Himmler -- or die trying. Fighting in advanced team-based multiplayer mode, you'll wage your own WWII in an all-out Axis vs. Allies contest for frontline domination.<br>\t\t\t\t\tPowered by the Quake III Arena engine, the Wolfenstein universe explodes with the kind of epic environments, A.I., firepower and cinematic effects that only a game created by true masters can deliver. The dark reich's closing in. The time to act is now. Evil prevails when good men do nothing. <br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Epic Environments<br>\t\t\t\t\t</li><li>Intense Story-Driven Action<br>\t\t\t\t\t</li><li>Ferocious A.I.<br>\t\t\t\t\t</li><li>Big Screen Cinematic Effects<br>\t\t\t\t\t</li><li>Team-Based Multiplayer Action</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/9010/header.jpg?t=1573221747",
        "developer": "Gray Matter Studios",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Quake III Arena",
        "description": "Quake III Arena is a critically acclaimed, multiplayer-focused, arena first-person shooter developed by id Software and released in 1999. <br />\r\n<br />\r\n*Quake III Arena now includes the main game and Quake III: Team Arena expansion pack. <br />\r\n<br />\r\nWelcome to the Arena <br />\r\n<br />\r\nThe greatest warriors of all time and space have been summoned to battle for the amusement of an ancient alien race. Wield a variety of guns and power-ups as you fight for glory against ruthless combatants in high-tech and gothic arenas in this fast-paced, skill-based single-player and multiplayer FPS. <br />\r\n<br />\r\n- Compete in fast-paced multiplayer action for up to 16 players <br />\r\n<br />\r\n- Play offline in single-player mode with AI-controlled bots <br />\r\n<br />\r\n- Enjoy exciting modes including Free for All (FFA), Team Deathmatch (TDM), Tournament (1v1), and Capture the Flag (CTF) <br />\r\n<br />\r\n- Experience thirty-five unique, gothic and sci-fi-infused arenas <br />\r\n<br />\r\n- Wield twelve powerful and unique weapons <br />\r\n<br />\r\nTeam Arena Expansion Pack <br />\r\n<br />\r\nIn this team-focused official expansion pack for Quake III Arena, choose one of five clans (The Fallen, Pagans, Crusaders, Intruders, and Stroggs) and fight for dominance. Master your clan’s strengths and weaknesses across a variety of new modes and arenas. Warriors once alone must now join forces and face the Arena as one. <br />\r\n<br />\r\n- Play the new single-player “Tournament” mode <br />\r\n<br />\r\n- Discover three new modes: One-Flag CTF, Overload, and Harvester <br />\r\n<br />\r\n- Experience twenty new arenas <br />\r\n<br />\r\n- Fight against four new AI bots: Pi, Fritzkrieg, Janet, and James <br />\r\n<br />\r\n- Wield three new guns: Chaingun, Nailgun, and Proximity Launcher <br />\r\n<br />\r\n- Harness two, new powerups called Kamikaze and Invulnerability Shield, and four CTF-only Runes called Scout, Doubler, Guard, and Ammo-Regen.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/2200/header.jpg?t=1660240549",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": 0,
        "name": "Quake II",
        "description": "Developed by id Software in 1997, Quake II is a critically acclaimed first-person shooter and sequel to Quake that deviates from the original by introducing an entirely new science fiction narrative and setting. <br />\r\n<br />\r\n*Quake II now includes the main game and both expansion packs: The Reckoning and Ground Zero. <br />\r\n<br />\r\nStory <br />\r\n<br />\r\nMankind is at war with the Strogg, a hostile alien race planning an invasion of Earth. To prevent the invasion, humanity launched a preemptive strike on the Strogg homeworld...it failed, but you survived. Outnumbered and outgunned, fight your way through fortified military installations and shut down the enemy's war machine. Only then will the fate of humanity be known. <br />\r\n<br />\r\nMission Pack: The Reckoning <br />\r\n<br />\r\nIn the first official expansion pack for Quake II, you are part of an elite commando force that must infiltrate a Strogg site. Once inside, you must scour industrial landscapes, crawl through waterways and air ducts, navigate treacherous canyons teeming with vicious mutants, stow away on an alien spacecraft, and destroy the enemy's secret moon base. <br />\r\n<br />\r\n- 18 New Single-Player Levels <br />\r\n<br />\r\n- 7 New Deathmatch Levels <br />\r\n<br />\r\n- 3 New Weapons - Ion Ripper, Phalanx Particle Cannon, and Trap <br />\r\n<br />\r\n- New Enemies and Power-ups <br />\r\n<br />\r\nMission Pack: Ground Zero <br />\r\n<br />\r\nTaking out the Big Gun sounded simple enough, but the Strogg were waiting. <br />\r\n<br />\r\nIn the second official expansion pack for Quake II, you, and a few marines are the lucky ones. You've made it to the surface of Stroggos in one piece and are still able to contact the fleet. The Gravity Well, the Strogg's newest weapon in its arsenal against mankind, is operational. With the fleet trapped around Stroggos, only 5% of ground forces surviving, and that number dwindling by the second, your orders have changed: free your comrades and destroy the Gravity Well. <br />\r\n<br />\r\n- 15 New Single-Player Levels <br />\r\n<br />\r\n- 14 New Deathmatch Levels <br />\r\n<br />\r\n- 5 New Weapons <br />\r\n<br />\r\n- New Enemies and Power-ups",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/2320/header.jpg?t=1660241977",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": "16",
        "name": "Deus Ex: Game of the Year Edition",
        "description": "The year is 2052 and the world is a dangerous and chaotic place. Terrorists operate openly - killing thousands; drugs, disease and pollution kill even more. The world's economies are close to collapse and the gap between the insanely wealthy and the desperately poor grows ever wider. Worst of all, an ages old conspiracy bent on world domination has decided that the time is right to emerge from the shadows and take control.<h2 class=\"bb_tag\">Key Features:</h2><br><ul class=\"bb_ul\"><li> Real role-playing from an immersive 3D, first-person perspective. The game includes action, character interaction and problem solving.<br></li><li> Realistic, recognizable locations. Many of the locations are built from actual blueprints of real places set in a near future scenario.<br></li><li> A game filled with people rather than monsters. This creates empathy with the game characters and enhances the realism of the game world.<br></li><li> Rich character development systems: Skills, augmentations, weapon and item selections and multiple solutions to problems ensure that no two players will end the game with similar characters.<br></li><li> Multiple solutions to problems and character development choices ensure a varied game experience. Talk, fight or use skills to get past obstacles as the game adapts itself to your style of play.<br></li><li> Strong storyline: Built on &quot;real&quot; conspiracy theories, current events and expected advancements in technology. If it's in the game, someone, somewhere believes</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/6910/header.jpg?t=1593506349",
        "developer": "Ion Storm",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": "16",
        "name": "Tomb Raider: Legend",
        "description": "Follow Lara Croft down a path of discovery as she travels the globe to remote, exotic locales in search of one of history's greatest artifacts that unleashes unwelcome figures from Lara's mysterious past. With guns blazing, Lara must use her athletic ability and intellectual wits to explore vast, treacherous tombs, riddled with challenging puzzles and deadly traps. Experience an adrenaline-fueled adventure in Tomb Raider: Legend!<br><br>KEY FEATURES:<br><ul class=\"bb_ul\"><li>Travel the globe as Lara Croft, the critically-acclaimed dual-pistol wielding heroine, of the classic Tomb Raider series. <br></li><li>Discover tombs and explore living breathing, lost ancient realms which hold clues to the secrets of Lara's past. <br></li><li>Physics, water, and fire systems bring perilous environments of Lara's world alive, creating new deadly challenges and obstacles.<br></li><li>Intuitive and fluid control system allows for seamless handling of any obstacle and interaction with dynamic surfaces.<br></li><li>Utilize an arsenal of new weapons, communication devices, a grappling hook, and other tools, to achieve your goals. <br></li><li>Explore ancient tombs, treacherous jungles, snowy mountain ranges, and more!</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/7000/header.jpg?t=1592494347",
        "developer": "Crystal Dynamics",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": "16",
        "name": "Tomb Raider: Anniversary",
        "description": "<strong>Tomb Raider: Anniversary </strong>retraces Lara Croft's original genre-defining adventure  globe-trotting 3rd person action-adventure in pursuit of the legendary Scion artifact. Using an enhanced 'Tomb Raider: Legend' game engine, the graphics, technology and physics bring Lara's adventure and pursuit of a mystical artifact known only as the Scion right up to today's technology standards and offers gamers a completely new gameplay experience. Re-imagined, Anniversary delivers a dynamic fluidly and fast Lara Croft, massive environments of stunning visuals, intense combat and game pacing, and an enhanced and clarified original story.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Epic Exploration - The lost city of Atlantis and ancient Egyptian pyramids are ripe for discovery: explore every hidden dark crevice and impossible heights; enter into strange, undiscovered lands and solve their deepest, darkest mysteries; open doors to new realms, uncover great rewards and unearth secrets to Lara's past.<br>\t\t\t\t\t</li><li>Acrobatic Gunplay - Deftly leap around charging enemies while you unleash a hail of bullets from your trademark dual pistols.<br>\t\t\t\t\t</li><li>Lethal Predators - The wilderness awaits with a wide range of bestial predatorsfrom bats to wolves to bearsready to defend their territory from human encroachment. New and improved AI means that all enemies will exhibit a more diverse behaviour set, providing improved combat challenges for the player.<br>\t\t\t\t\t</li><li>Supernatural elements are used sparingly to provide a mystical allure around the world, while maintaining the world's grounded core. The awesome T-Rex and intriguing Atlantean centaurs suck you in to the wonderfully intriguing and mysterious world of Tomb Raider.<br>\t\t\t\t\t</li><li>Death-Defying Environmental Playground - Leap over massive gaps, cling onto rock ledges, and swim through underground tunnels.<br>\t\t\t\t\t</li><li>Solve the Diabolical Machinery of the Past - seek to outwit the brilliant ancient designers of many epic puzzles and vaults in order to uncover their secrets. Be warned that they do not take kindly to 'meddling', and as such, the price of failure is extreme.</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/8000/header.jpg?t=1661335374",
        "developer": "Crystal Dynamics",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": "18",
        "name": "Hitman: Blood Money",
        "description": "<a href=\"http://store.steampowered.com/app/863550/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/6860/extras/BUY_NOW_Banner_01.png?t=1599829743\" /></a><br><br>Money Talks. Silence Pays. Prepare to Make a Killing. When assassins from Agent 47's contract agency, The ICA, are eliminated in a series of hits, it seems a larger, more powerful agency has entered the fray. Sensing he may be a target, 47 travels to America, and prepares to make a killing.<br>\t\t\t\t\t<ul class=\"bb_ul\"><li>'Blood Money' system: the cleaner the 'hit' the more money you receive which can be spent on bribing witnesses and police to reduce your notoriety, weapon customisation, specialist equipment and information.<br>\t\t\t\t\t</li><li>Customisable weapons: modify Agent 47's custom weapons in a variety of ways including sound, recoil, rate of fire, damage, reload speed, accuracy and zoom.<br>\t\t\t\t\t</li><li>Strong narrative: who is wiping out the ICA and what is their motivation?<br>\t\t\t\t\t</li><li>New engine: the world of the assassin has never been so interactive or looked so good!<br>\t\t\t\t\t</li><li>New gameplay techniques: including disarm, distraction, accidents, body disposal, human shield and decoy weapons.<br>\t\t\t\t\t</li><li>New control and camera system: Agent 47 now moves independently of the camera.<br>\t\t\t\t\t</li><li>New moves: Agent 47 can now climb, hide, scale ledges and automatically pass low obstacles.<br>\t\t\t\t\t</li><li>Improved AI: guards will follow blood trails, investigate suspicious items and behaviour. New pathfinder engine provides improved tracking and movement with realistic enemy behaviour and interaction.<br>\t\t\t\t\t</li><li>Soundtrack by BAFTA-winning composer Jesper Kyd.</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/6860/header.jpg?t=1599829743",
        "developer": "Io-Interactive A/S",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2007,
        "age": "18",
        "name": "Quake",
        "description": "Developed by the award-winning id Software, Quake® is the ground-breaking, original dark fantasy first-person shooter that inspires today’s retro-style FPS games. With Quake (Enhanced), experience the authentic, updated, and visually enhanced version of the original.<h2 class=\"bb_tag\">Experience the Original Game, Enhanced</h2>Enjoy the original, authentic version of Quake, now with up to 4K* and widescreen resolution support, enhanced models, dynamic and colored lighting, anti-aliasing, depth of field, the original, atmospheric soundtrack and theme song by Trent Reznor, and more. There’s never been a better time to play Quake.<h2 class=\"bb_tag\">Play the Dark Fantasy Campaign</h2>You are Ranger, a warrior armed with a powerful arsenal of weapons. Fight corrupted knights, deformed ogres and an army of twisted creatures across four dark dimensions of infested military bases, ancient medieval castles, lava-filled dungeons and gothic cathedrals in search of the four magic runes. Only after you have collected the runes will you hold the power to defeat the ancient evil that threatens all of humanity.<h2 class=\"bb_tag\">Get the Original &amp; New Expansion Packs</h2>Quake also comes with both original expansion packs: “The Scourge of Armagon” and “Dissolution of Eternity,” as well as two expansions developed by the award-winning team at MachineGames: “Dimension of the Past,” and the all-new “Dimension of the Machine.”<h2 class=\"bb_tag\">Discover the All-New “Dimension of the Machine” Expansion</h2>In the deepest depths of the labyrinth lies the core of lava and steel known only as The Machine. Crusade across time and space against the forces of evil to bring together the lost runes, power the dormant machine, and open the portal hiding the greatest threat to all known worlds—destroy it...before it destroys us all.<h2 class=\"bb_tag\">Horde Mode</h2>Experience the all-new Horde Mode and add-ons for Quake, free to all players. Grab your guns and drop into Horde Mode - play solo, with friends online, or in local multiplayer split-screen. Unlock powerful weapons and power-ups and battle your way through endless waves of monsters.<h2 class=\"bb_tag\">Enjoy Online &amp; Local Multiplayer and Co-op</h2>Fight through the dark fantasy base campaign and expansions in 4-player online or local split-screen co-op, and compete in pure, retro-style combat with support for 8-player (online) or 4-player (local split-screen) matches. Featuring dedicated server support for online matchmaking and peer-to-peer support for custom matches.<h2 class=\"bb_tag\">Download Additional, Free Mods &amp; Missions</h2>Expand your experience with free, curated, fan-made and official mods and missions such as Quake 64, which is available to download and play now. More fan-made and official mods and missions coming soon.<h2 class=\"bb_tag\">Play together With Crossplay</h2>Play the campaign and all expansion packs cooperatively or go toe-to-toe in multiplayer matches with your friends regardless of platform! Crossplay is supported among PC (controller-enabled), Xbox One, Xbox Series X/S, PS4, PS5  and Nintendo Switch.<h2 class=\"bb_tag\">Get the “original” and “enhanced” Versions </h2>Play whichever version of Quake you prefer. Ownership of  Quake gives you access to Quake (Original), the fully-moddable, untouched version of the game that has been available for years  , and Quake (Enhanced), the recently released version of the game with improved visuals, curated add-ons, enhanced multiplayer support, crossplay, controller support, and more. <br><br><br>*Maximum display resolutions vary by platform.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/2310/header.jpg?t=1660240704",
        "developer": "id Software",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    },
    {
        "releaseYear": 2016,
        "age": "18",
        "name": "BioShock™ Remastered",
        "description": "BioShock is a shooter unlike any you've ever played, loaded with weapons and tactics never seen. You'll have a complete arsenal at your disposal from simple revolvers to grenade launchers and chemical throwers, but you'll also be forced to genetically modify your DNA to create an even more deadly weapon: you.<h2 class=\"bb_tag\">Features:</h2><ul class=\"bb_ul\"><li>Museum of Orphaned Concepts<br></li><li>Challenge Rooms<br></li><li>Director’s Commentary: Imagining BioShock, featuring Ken Levine and Shawn Robertson<br></li><li>Achievements<br></li><li>Full Controller Support<br></li><li>High Resolution Textures, Models and Interface<br></li><li>4K Resolution Support</li></ul>",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/409710/header.jpg?t=1598321131",
        "developer": "2K Boston",
        "platforms": {
            "windows": true,
            "mac": true,
            "linux": false
        }
    },
    {
        "releaseYear": 2008,
        "age": "18",
        "name": "Grand Theft Auto: San Andreas",
        "description": "Five years ago Carl Johnson escaped from the pressures of life in Los Santos, San Andreas... a city tearing itself apart with gang trouble, drugs and corruption. Where filmstars and millionaires do their best to avoid the dealers and gangbangers. <br />\r\n<br />\r\nNow, it's the early 90s. Carl's got to go home. His mother has been murdered, his family has fallen apart and his childhood friends are all heading towards disaster. <br />\r\n<br />\r\nOn his return to the neighborhood, a couple of corrupt cops frame him for homicide. CJ is forced on a journey that takes him across the entire state of San Andreas, to save his family and to take control of the streets.",
        "image": "https://cdn.akamai.steamstatic.com/steam/apps/12120/header.jpg?t=1634144450",
        "developer": "Rockstar Games",
        "platforms": {
            "windows": true,
            "mac": false,
            "linux": false
        }
    }
]