[{"releaseYear":2006,"age":0,"name":"Psychonauts","description":"A Psychic Odyssey Through the Minds of Misfits, Monsters, and Madmen.<br />\r\n<br />\r\nThis classic action/adventure platformer from acclaimed developers Double Fine Productions follows the story of a young psychic named Razputin. In his quest to join the Psychonauts--an elite group of international psychic secret agents--he breaks into their secret training facility: Whispering Rock Psychic Summer Camp. But this is no average psychic summer camp! A mysterious villain has kidnapped Raz’s fellow campers and stolen their brains. Now he must use his psychic powers of Telekinesis, Levitation, and most of all his ability to project himself into the minds of others--to find the loose noodles and keep them from falling into the wrong hands. Fight mental demons! Uncover hidden memories! Sort emotional baggage! Explore the fantastic realm of the inner mind! Join the Psychonauts!","image":"https://cdn.akamai.steamstatic.com/steam/apps/3830/header.jpg?t=1658789735","developer":"Double Fine Productions","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2004,"age":0,"name":"Half-Life 2: Deathmatch","description":"Fast multiplayer action set in the Half-Life 2 universe! HL2's physics adds a new dimension to deathmatch play. Play straight deathmatch or try Combine vs. Resistance teamplay. Toss a toilet at your friend today!","image":"https://cdn.akamai.steamstatic.com/steam/apps/320/header.jpg?t=1602536087","developer":"Valve","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2005,"age":0,"name":"Half-Life 2: Lost Coast","description":"Originally planned as a section of the Highway 17 chapter of Half-Life 2, Lost Coast is a playable technology showcase that introduces High Dynamic Range lighting to the Source engine.","image":"https://cdn.akamai.steamstatic.com/steam/apps/340/header.jpg?t=1571757270","developer":"Valve","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2009,"age":0,"name":"Plants vs. Zombies GOTY Edition","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/3590/extras/PvZ_background.jpg?t=1615390608\" /><br><br>Zombies are invading your home, and the only defense is your arsenal of plants! Armed with an alien nursery-worth of zombie-zapping plants like peashooters and cherry bombs, you'll need to think fast and plant faster to stop dozens of types of zombies dead in their tracks. Obstacles like a setting sun, creeping fog and a swimming pool add to the challenge, and with five game modes to dig into, the fun never dies!<h2 class=\"bb_tag\">Features</h2>                    <ul class=\"bb_ul\"><li>Play five game modes: Adventure, Mini-Games, Puzzle, Survival, plus the stress-free Zen Garden<br>                    </li><li>Conquer all 50 levels of Adventure mode  through day, night, and fog, in a swimming pool and on the rooftop<br>                    </li><li>Battle 26 types of zombies including pole-vaulters, snorkelers and Zomboni drivers<br>                    </li><li>Earn 49 powerful perennials and collect coins to buy a pet snail, power-ups and more!<br>                    </li><li>Open the Almanac to see all the plants and zombies, plus amusing facts and quotes<br>                    </li><li>Browse Crazy Daves shop for special plants and tools to stem any zombie assault<br>                    </li><li>Amazing graphics and soundtrack, plus a bonus music video<br>                    </li><li>Infinite replayability: the game is never the same experience twice!<br>                    </li><li>Unlock all the Steam Achievements<br>                    </li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/3590/header.jpg?t=1615390608","developer":"PopCap Games, Inc.","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2009,"age":0,"name":"Dragon Age: Origins","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/17450/extras/DRAGNORlogoDRAGON.png?t=1654009248\" /><br><br>You are a Grey Warden, one of the last of a legendary order of guardians. With the return of an ancient foe and the kingdom engulfed in civil war, you have been chosen by fate to unite the shattered lands and slay the archdemon once and for all.<br><br><strong>A Stunning World to Explore</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>BioWare’s deepest universe to date with over 80 hours of gameplay and more than double the size and scope of Mass Effect<br>\t\t\t\t\t</li><li>Travel throughout dozens of environments and fully immerse yourself in a shattered world that is on the brink of utter annihilation<br>\t\t\t\t\t</li><li>An epic story that is completely shaped and reactive to your play style<br>\t\t\t\t\t</li></ul><strong>Complex Moral Choices</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>There are no easy choices<br>\t\t\t\t\t</li><li>Tailor your Dragon Age: Origins experience from the very beginning by choose from six different Origin Stories<br>\t\t\t\t\t</li><li>Decide how to handle complex issues like murder, genocide, betrayal, and the possession/sacrificing of children without the security of a good/bad slider to tell you what to do<br>\t\t\t\t\t</li></ul><strong>Full Character Customization</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Sculpt your hero in your own image or fantasy<br>\t\t\t\t\t</li><li>Elaborate character creator allows you to create your own hero unique from anyone else<br>\t\t\t\t\t</li><li>Shape your character’s personality and morality based on the choices you make throughout the game<br>\t\t\t\t\t</li></ul><strong>Engage in Bone-Crushing, Visceral Combat</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Battle against massive and terrifying creatures<br>\t\t\t\t\t</li><li>Unleash legendary powers and choose from over 100 different magical spells and skills<br>\t\t\t\t\t</li><li>Experience the adrenaline rush of brutal combat, beheading your foes or casting spells that make enemies explode from within<br>\t\t\t\t\t</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/17450/extras/BloodArmor.jpg?t=1654009248\" />  Blood Dragon Armor<br>\t\t\t\t\t\tCommissioned by an infamous Nevarran dragon hunter, this armor was crafted in a time when dragons had almost been hunted to extinction. Infused with their blood, the armor gained notoriety after the hunter died at the hands of men rather than the dragons it was designed to protect him from.<br>\t\t\t\t\t\t<ul class=\"bb_ul\"><li>Grants exceptional protection in combat<br>\t\t\t\t\t\t</li><li>Armor will be usable in BioWare's upcoming science fiction epic, Mass Effect 2<br>\t\t\t\t\t\t</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/17450/extras/StonePrisoner.jpg?t=1654009248\" />  The Stone Prisoner<br>\t\t\t\t\t\tThe darkspawn-infested village of Honnleath holds a secret: the forgotten stone figure at the town’s heart is a powerful golem frozen in time. Free the creature and reveal a storied quest to unlock its power and mysterious past.<br>\t\t\t\t\t\tDownload The Stone Prisoner and gain access to Shale, a mighty stone golem who can join the party and travel throughout Dragon Age: Origins. One of the most powerful characters in the game, Shale comes with a rich back story, extensive voice acting, and a unique follower quest to explore. The Stone Prisoner also includes new environments, items, and hours of additional gameplay that adds to the Dragon Age: Origins campaign.<br>\t\t\t\t\t\t<ul class=\"bb_ul\"><li>A powerful new party member to aid in the epic quest to save Ferelden from the Blight<br>\t\t\t\t\t\t</li><li>New areas, including the troubled village of Honnleath<br>\t\t\t\t\t\t</li><li>New achievements, items, and unique insights into the Dragon Age: Origins storyline<br>\t\t\t\t\t\t</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/17450/header.jpg?t=1654009248","developer":"BioWare","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2010,"age":0,"name":"Mass Effect 2 (2010)","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/24980/extras/ME.jpg?t=1615504486\" /><br><br><strong>Recruit. Explore. Control.</strong><br><br>Two years after Commander Shepard repelled invading Reapers bent on the destruction of organic life, a mysterious new enemy has emerged. On the fringes of known space, something is silently abducting entire human colonies. Now Shepard must work with Cerberus, a ruthless organization devoted to human survival at any cost, to stop the most terrifying threat mankind has ever faced. <br><br>To even attempt this perilous mission, Shepard must assemble the galaxy’s most elite team and command the most powerful ship ever built. Even then, they say it would be suicide. Commander Shepard intends to prove them wrong. <br><br>Just like in the previous game, what you say to the other characters matters a great deal. Fortunately, the conversation system has been improved. The camera now pans around characters as they talk to one another to evoke a dramatic, cinematic feel. Also, Shepard can interrupt the conversation when given the appropriate prompt, taking situations into new directions that could help or hinder the mission.<br><br>Shepard is more customizable than ever, letting you create your ideal lead character — gender, facial features, class, and of course, attitude. Once you embark on missions, you’ll be treated to an improved battle system that lets you target weak points and blast off your enemy’s limbs with a variety of weapons.<br><br>Set out to lead your team to victory… or die at the hands of The Collectors. Either path is possible in BioWare’s smash hit, Mass Effect 2. Which destiny will you choose?<br><br>Features:<br><ul class=\"bb_ul\"><li>The second act of BioWare’s epic sci-fi trilogy continues the story of Commander Shepard and humanity’s first steps onto the galactic stage <br></li><li>Success – or failure – depends heavily on the crew you assemble and their loyalty to you and the mission <br></li><li>Stunning graphics and a refined dialog system will draw you into the story like never before <br></li><li>Numerous improvements to the intense, third-person shooter combat <br></li><li>Deep character customization options let you create your own vision of Commander Shepard</li></ul><h2 class=\"bb_tag\">Online Disclaimer</h2>EA ACCOUNT, REGISTRATION WITH ENCLOSED SERIAL CODE, INTERNET CONNECTION AND ACCEPTANCE OF END USER LICENSE AGREEMENT REQUIRED TO ACCESS ONLINE FEATURES AND/OR SERVICES.  EA ONLINE TERMS AND CONDITIONS CAN BE FOUND AT <a href=\"http://WWW.EA.COM\" target=\"_blank\" rel=\"noreferrer\"  >WWW.EA.COM</a>.  YOU MUST BE 13+ TO REGISTER FOR AN EA ACCOUNT.  EA MAY PROVIDE CERTAIN INCREMENTAL CONTENT AND/OR UPDATES FOR NO ADDITIONAL CHARGE, IF AND WHEN AVAILABLE.  EA MAY RETIRE ONLINE FEATURES AFTER 30 DAYS NOTICE POSTED ON <a href=\"http://WWW.EA.COM\" target=\"_blank\" rel=\"noreferrer\"  >WWW.EA.COM</a>.","image":"https://cdn.akamai.steamstatic.com/steam/apps/24980/header.jpg?t=1615504486","developer":"BioWare","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2010,"age":0,"name":"Bejeweled® 3","description":"The biggest, brightest Bejeweled ever!<br>\t\t\t\t\t\tDiscover all-new ways to play the world’s #1 puzzle game. Find your perfect match with 8 breathtaking game modes that meet all your moods — ease into Classic Bejeweled for cascades of fun, journey through 40 challenging Quest puzzles, charge into the electrifying Lightning for non-stop action, and tailor your experience in Zen for a revolutionary new way to relax.<br>\t\t\t\t\t\tEnjoy the amazing sights and sounds and engage in endless gem-matching fun, and earn flashy achievement badges as you soar to dazzling new heights!<br>\t\t\t\t\t\t<h2 class=\"bb_tag\">Key Features:</h2><ul class=\"bb_ul\"><li>8 ways to play: With so many new ways to play, you’ll find a perfect match for every mood!<br>\t\t\t\t\t\t</li><li>Classic mode: Play the most popular puzzle game of the century, with powerful new gems and new ultra-smooth gameplay<br>\t\t\t\t\t\t</li><li>Quest mode: Journey through 40 magical puzzles in this multifaceted Bejeweled challenge!<br>\t\t\t\t\t\t</li><li>Zen mode: Tailor your experience with sights, sounds and binaural beats to create your own relaxing retreat<br>\t\t\t\t\t\t</li><li>Lightning mode: Charge up with a challenging timed game of heart-pounding, gem-blasting fun!<br>\t\t\t\t\t\t</li><li>Secret modes: Unlock 4 all-new games as you play<br>\t\t\t\t\t\t</li><li>Badges: Earn up to 65 badges to prove your multifaceted skills<br>\t\t\t\t\t\t</li><li>High-definition graphics: Amazing sights and sounds — Bejeweled is more sparkling than ever before!<br>\t\t\t\t\t\t</li><li>Ultra-smooth action: Make multiple matches while new gems fall into place</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/78000/header.jpg?t=1615298902","developer":"PopCap Games, Inc.","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2010,"age":0,"name":"Back to the Future: The Game","description":"Marty McFly and Doc Brown return in a completely new Back to the Future adventure. Six months after the events of the third film, the DeLorean Time Machine mysteriously returns to Hill Valley - driverless! Marty must go back in time and get aid from a resistant teenage Emmett Brown, or else the space time continuum will forever be unraveled!<br><br>\t\t\t\t\t\t\t\t<ul class=\"bb_ul\"><li>Episode 1: It's About Time<br>\t\t\t\t\t\t\t\t</li><li>Episode 2: Get Tannen!<br>\t\t\t\t\t\t\t\t</li><li>Episode 3: Citizen Brown<br>\t\t\t\t\t\t\t\t</li><li>Episode 4: Double Visions<br>\t\t\t\t\t\t\t\t</li><li>Episode 5: OUTATIME - Finale!<br>\t\t\t\t\t\t\t\t</li></ul><h2 class=\"bb_tag\">Key Features</h2>\t\t\t\t\t\t\t\t<ul class=\"bb_ul\"><li>Special Appearance by Michael J. Fox!<br>\t\t\t\t\t\t\t\t</li><li>Christopher Lloyd and Claudia Wells return to voice Doc Brown and Jennifer Parker<br>\t\t\t\t\t\t\t\t</li><li>Collaboration with Bob Gale Film, Trilogy Co-Creator/Writer <br>\t\t\t\t\t\t\t\t</li><li>Back to the Future’s “first families.” The McFlys, the Browns, and of course, the Tannens – all play key roles.<br>\t\t\t\t\t\t\t\t</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/31290/header.jpg?t=1542232304","developer":"Telltale Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":null,"age":0,"name":"Back to the Future: Ep 2 - Get Tannen!","description":"","image":"https://cdn.akamai.steamstatic.com/steam/apps/94500/header.jpg?t=1542232321","developer":"Telltale Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":null,"age":0,"name":"Back to the Future: Ep 3 - Citizen Brown","description":"","image":"https://cdn.akamai.steamstatic.com/steam/apps/94510/header.jpg?t=1542232326","developer":"Telltale Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":null,"age":0,"name":"Back to the Future: Ep 4 - Double Visions","description":"","image":"https://cdn.akamai.steamstatic.com/steam/apps/94520/header.jpg?t=1542232331","developer":"Telltale Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":null,"age":0,"name":"Back to the Future: Ep 5 - OUTATIME","description":"","image":"https://cdn.akamai.steamstatic.com/steam/apps/94530/header.jpg?t=1542232337","developer":"Telltale Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2011,"age":0,"name":"Portal 2","description":"Portal 2 draws from the award-winning formula of innovative gameplay, story, and music that earned the original Portal over 70 industry accolades and created a cult following.<br><br>\t\t\t\t\t\t\t\t\t\tThe single-player portion of Portal 2 introduces a cast of dynamic new characters, a host of fresh puzzle elements, and a much larger set of devious test chambers. Players will explore never-before-seen areas of the Aperture Science Labs and be reunited with GLaDOS, the occasionally murderous computer companion who guided them through the original game.<br>\t\t\t\t\t\t\t\t\t\t<br>\t\t\t\t\t\t\t\t\t\tThe game’s two-player cooperative mode features its own entirely separate campaign with a unique story, test chambers, and two new player characters. This new mode forces players to reconsider everything they thought they knew about portals. Success will require them to not just act cooperatively, but to think cooperatively.<br>\t\t\t\t\t\t\t\t\t\t<br>\t\t\t\t\t\t\t\t\t\t<strong>Product Features</strong><br>\t\t\t\t\t\t\t\t\t\t<ul class=\"bb_ul\"><li><strong>Extensive single player:</strong> Featuring next generation gameplay and a wildly-engrossing story.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Complete two-person co-op:</strong> Multiplayer game featuring its own dedicated story, characters, and gameplay.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Advanced physics:</strong> Allows for the creation of a whole new range of interesting challenges, producing a much larger but not harder game.<br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Original music.</strong><br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Massive sequel:</strong> The original Portal was named 2007's Game of the Year by over 30 publications worldwide. <br>\t\t\t\t\t\t\t\t\t\t</li><li><strong>Editing Tools:</strong> Portal 2 editing tools will be included.<br>\t\t\t\t\t\t\t\t\t\t</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/620/header.jpg?t=1610490805","developer":"Valve","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2010,"age":0,"name":"Worms Reloaded","description":"Ten years on from Worms™ Armageddon and the turn-based comic mayhem continues in Worms™ Reloaded, an all-new edition available for PC through Steam. Worms™ Reloaded features up to four player online and offline multi-player, voice support, a raft of crazy new weapons (and the return of some iconic weapons from the brand’s celebrated past), achievements (*note: Mac &amp; Linux versions have a reduced number of achievements), leaderboards, all new high-definition landscape themes, a range of brilliant forts for the new Fort mode, new landscape editor, new play modes, hats, skins and speech banks.<br>\t\t\t\t\tTo top it all off, there is also a highly-involving single-player experience with tutorials, deathmatches, races, fort games and puzzles. Enjoy the new High Definition full colour graphics engine, revised physics and pit your wits against the all-new A.I. with seven personality types, ranging from easy to very hard and styles like vengeful, cocky and ‘Darksider’! The game is also packed with customization options, and includes thousands of possibilities for your team of worms, tons of game options and custom levels, so you can play the game how you want!<br>\t\t\t\t\t<h2 class=\"bb_tag\">Key Features:</h2>\t\t\t\t\t<strong>EXTENSIVE SINGLE-PLAYER CONTENT:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Campaign mode. Play through 35 single-player missions as well as 30 more in the Warzone Campaign that is tuned for advanced players.<br>\t\t\t\t\t\t  </li><li>Bodycount mode! How will you survive with having just one worm pitched against never ending spawning enemy worms that get increasingly tougher? Compete against friends in the scored leaderboard.<br>\t\t\t\t\t\t  </li><li>Training Mode. Comprehensive tactics tutorage that includes 3 tutorials and 3 different firing ranges.<br>\t\t\t\t\t</li></ul><strong>ONLINE AND LOCAL MULTI-PLAYER:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Up to 4-player online and local multiplayer action - with Steamworks support, for pain free game updates, friends-lists, leaderboards, achievements (*note: Mac &amp; Linux versions have a reduced number of achievements) and chat.<br>\t\t\t\t\t\t  </li><li>Leaderboards! Multiple different leaderboards to track different game types and stats. These can be sorted globally or by friends enabling and encouraging competition between friends.<br>\t\t\t\t\t</li></ul><strong>MASSIVELY INCREASED CUSTOMISATION:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Wild customisation and personalization - change appearance of worm skin, choose victory dances, gravestones, voices, HUD, title and over 70 different cute, funny and downright stupid hats!<br>\t\t\t\t\t\t  </li><li>Shop ‘til you drop! Players can buy hats, landscapes, weapons, missions, forts and gravestones with currency awarded for completing single player campaigns.<br>\t\t\t\t\t\t  </li><li>Over 70 speechbanks - 50 re-mastered from the classics and over 20 new speech banks including the insane Cheese sound set!<br>\t\t\t\t\t\t  </li><li>A range of great classic and new custom levels to play on, plus make your own!<br>\t\t\t\t\t</li></ul><strong>NEW FULLY FEATURED LANDSCAPE CREATION TOOL:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Fully featured landscape editor including the welcome return of bridges and the ability to import your own custom levels into game so you can share your creation with friends and play online. Add your own start positions, mines and scheme to effectively create wild new play modes and styles of game.<br>\t\t\t\t\t\t  </li><li>All new vertical landscapes – to take the battle to new heights!<br>\t\t\t\t\t\t  </li><li>The scheme editor enables the changing of all aspects of the game to fit your own style, including new random objects such as the sentry guns and electro magnets, and a new fire hazard.<br>\t\t\t\t\t</li></ul><strong>WORMS™ WEAPONRY AND UTILITIES:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>47 weapons and utilities including classic weapons from Worms™, Worms™ 2, Armageddon, World Party and the recent Open Warfare series as well as 14 brand new weapons!<br>\t\t\t\t\t\t  </li><li>New weapons include Super Bunker Buster, Ferrets, Poison Strike, Worship, Sentry Gun, Electromagnet, Buffalo of Lies plus new persistent fire and surprise Easter Eggs!<br>\t\t\t\t\t\t  </li><li>Classic Weapons returning include Armageddon, Concrete Donkey, Napalm Strike and yes, the Holy Hand Grenade!<br>\t\t\t\t\t</li></ul><strong>GAME MODES:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>Select from a range of classic Worms™ game modes and new modes for this edition - Crate/Shopper modes, BnG (Bazooka and Grenade), Forts and Rope Racing.<br>\t\t\t\t\t\t  </li><li>Use the customisation tools to make your own mode!<br>\t\t\t\t\t</li></ul><strong>HIGH DEFINITION VISUALS:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>13 HD graphical themes for millions of random levels - never play the same game twice!<br>\t\t\t\t\t\t  </li><li>Worms™ has never looked this good with all new High Definition landscape artwork - based on the most loved Worms™ game ever made.<br>\t\t\t\t\t\t  </li><li>Widescreen support, optional blur effect for backgrounds, 16 specially designed forts for the fantastic Fort mode.<br>\t\t\t\t\t</li></ul><strong>PC SPECIFIC CONTROLS:</strong><br>\t\t\t\t\t<ul class=\"bb_ul\"><li>User defined controls with classic settings as standard.<br>\t\t\t\t\t\t  </li><li>Function key support for fast access to common weapons.<br>\t\t\t\t\t\t  </li><li>Works with compatible USB gamepad.<br>\t\t\t\t\t\t  </li><li>It also runs on all modern Windows Operating Systems.<br>\t\t\t\t\t</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/22600/header.jpg?t=1596807362","developer":"Team17 Digital Ltd","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2012,"age":0,"name":"Ticket to Ride","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/108200/extras/20191030-ttr-page-steam_02.png?t=1660753992\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/108200/extras/20191030-ttr-page-steam_04.png?t=1660753992\" /><br>Set off with your friends and family to re(discover) Ticket to Ride, the classic boardgame. In this railway adventure, you’ll need to be the quickest to link up your cities and reach your destinations.<br>In this strategy game for all ages, try out different tactics, block your competitors’ lines and take over routes before the others do. With so many different strategies to try, each new game is a unique experience.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/108200/extras/maps.gif?t=1660753992\" /><br>Travel the world from Europe to India, passing through the legendary China, facing new challenges by purchasing additional maps with their own special rules (available in expansion packs). A tutorial teaches you the rules of the game so you can head off quickly on your adventure.<br>Play in single-player mode, online multi-player against the whole world, or local multi-player with your friends.<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/108200/extras/EN_09.png?t=1660753992\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/108200/extras/connectCities.gif?t=1660753992\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/108200/header.jpg?t=1660753992","developer":"Days of Wonder","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2011,"age":0,"name":"Bastion","description":"<strong>Bastion</strong> is an action role-playing experience that redefines storytelling in games, with a reactive narrator who marks your every move. Explore more than 40 lush hand-painted environments as you discover the secrets of the Calamity, a surreal catastrophe that shattered the world to pieces. Wield a huge arsenal of upgradeable weapons and battle savage beasts adapted to their new habitat. Finish the main story to unlock the New Game Plus mode and continue your journey!<br>\t\t\t\t\t\t<h2 class=\"bb_tag\">Key Features:</h2>\t\t\t\t\t\t<ul class=\"bb_ul\"><li>Action-packed combat rewards playing with finesse<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/107100/extras/preview-full-Bastion_Combat1.png?t=1601950406\" /><br>\t\t\t\t\t\t</li><li>Hours of reactive narration delivers a deep story<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/107100/extras/preview-full-Bastion_Loop.png?t=1601950406\" /><br></li><li>Stunning hand-painted artwork in full 1080p resolution<br>\t\t\t\t\t\t</li><li>Critically-acclaimed original music score<br>\t\t\t\t\t\t</li><li>Controls custom-tailored to PC plus gamepad support<br>\t\t\t\t\t\t</li><li>10+ unique upgradeable weapons to be used<br>\t\t\t\t\t\t</li><li>6 powerful Bastion structures to be discovered<br>\t\t\t\t\t\t</li><li>'New Game Plus' and 'Score Attack' modes unlocked after finishing the story<br>\t\t\t\t\t\t</li><li>'No-Sweat Mode' lets players of any skill level enjoy the story</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/107100/header.jpg?t=1601950406","developer":"Supergiant Games","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2012,"age":0,"name":"Worms Revolution","description":"Worms™ Revolution is the latest game in the classic turn-based strategy series to come to the PC,  featuring exciting new features and beautiful 3D graphics whilst retaining the classic 2D gameplay that fans love. Choose to play the extensive single player mode which features both campaign and puzzle missions or dive straight into multiplayer warfare via online or local play. For the first time ever see the inclusion of dynamic water, physics objects and worm classes! Customise your experience by choosing what classes you play with, what they look like and even how they speak!<br> <br>Worms™ Revolution sticks an exploding sheep under worm-on-worm conflict and blasts it squarely into the 21st century.<h2 class=\"bb_tag\">Key Features</h2> <br><ul class=\"bb_ul\"><li>Class Acts! Choose from 4 different classes: Soldier, Scout, Scientist and Heavy. Players can unlock a total of 16 worms (4 of each class) to form their teams. It’s possible to take any combination of classes into a match.<br></li><li>Customize Your Worms! Customize your worms using a variety of hats, glasses, moustaches, gravestones, victory dances, soundbanks, and for the first time ever, trinkets!<br></li><li>Extensive Single Player Mode. Battle your way through 32 single player campaign missions. Fancy exercising your brain as well as your brawn? There are 20 puzzle missions waiting for you!<br></li><li>Includes a Level Editor.  Create new environments for you worms to battle in and destroy.  <br></li><li>Stunning New Landscapes. Fight to the death across 4 unique environments: Beach, Sewer, Farmyard and Spooky.<br></li><li>Multiplayer Battles! Experience local or online battles with up to 4 players. Choose from 3 different game modes: Deathmatch, Forts or Classic mode.<br></li><li>Dynamic Water. Dynamic water features in an array of new weapons and utilities and it can also appear already on the landscape in matches.<br></li><li>Exploding Physics Objects! Physics objects are destructible items that possess devastating effects as some have different properties when they explode. Watch out as they release fire, poison and water!<br></li><li>New Weapons. Wash those worms away using the new water weapons: Water Bomb, Water Pistol and Water Strike. Dynamic water can be drained away with the addition of the new Plug Hole utility. There’s also Stick Up, which is used to steal from your opponent’s inventory and the Wrench, which can repair damaged Sentry Guns and physics objects.<br></li><li>Hilarious Script and Voice Over Talent.  Worms™ Revolution brings together two comedy legends, who between them bring alive the humorous world of Worms. Multi-BAFTA award winning writer Dean Wilkinson provides the script, which is hilariously brought to life by the accomplished Matt Berry as the unseen narrator of the game, Don Keystone, a wildlife documentary maker.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/200170/header.jpg?t=1655730041","developer":"Team17 Digital Ltd","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2012,"age":0,"name":"Giana Sisters: Twisted Dreams","description":"Giana Sisters: Twisted Dreams is a blistering hardcore platformer with contrasting worlds. Warp Giana’s vivid dreams to alter your abilities and destroy the twisted creatures lurking within. Giana Sisters: Twisted Dreams combines the challenge of retro era platforming with graphics that pack a visual punch and tight controls.<br><br>Fluidly morph between two dynamically different dream worlds to solve puzzles and combat grueling enemies.  Players will have to intertwine sweet Giana's twirling jump attack with Punk Giana's hammering dash attack to survive the dualling dimensions.<br><br><strong>Now featuring a brand new competitive multiplayer arena racing mode!</strong><br><br>The game sets up to 4 players against each other in local PvP, speed-running in an effort to push each other off the screen with the help of boosters and power-ups. <br><br>Smash through all obstacles!  Run, dash, jump, head bonk, fire cannonballs and barrages of bullets onto your opponents. Switch the level layout on the fly as you rush through dreamgates.  Collect gems to fill your speed booster and use your power-ups to knock out the other players.<h2 class=\"bb_tag\">Key Features</h2><br><ul class=\"bb_ul\"><li><strong>Powerful Abilities:</strong> Change Giana's personality to unlock her unique abilities - you'll need to control both sides to survive her dreams!</li></ul><ul class=\"bb_ul\"><li><strong>Intuitive Controls and Smooth Gameplay: </strong>Master the tight knit controls to defeat the cunning trials ahead.</li></ul><ul class=\"bb_ul\"><li><strong>Visual Punch:</strong>Giana’s dreamworlds leap off the screen with gorgeous 3D graphics that morph before your eyes.</li></ul><ul class=\"bb_ul\"><li><strong>Twisted Puzzles:</strong> As Giana changes, so does the world around her.   Collecting gems and finding secret locations requires strategy and interchanging the two worlds.</li></ul><ul class=\"bb_ul\"><li><strong>Legendary Soundtrack:</strong>Each dream layer has its own music style. Experience a dual crossfading soundtrack by Chris Hülsbeck and Machinae Supremacy!</li></ul><ul class=\"bb_ul\"><li><strong>Explore and Discover:</strong> There are 23 rich levels across 3 distinct worlds, each transforming into the two contrasting dreamworlds.</li></ul><ul class=\"bb_ul\"><li><strong>Epic Boss Battles:</strong>Take on gigantic creatures dredged from the depths of Giana’s most terrifying nightmares. Each unique boss has only one thing in common with the others – they’re utterly brutal!</li></ul><ul class=\"bb_ul\"><li><strong>Gut-wrenching Hardcore Modes:</strong> Hardcore and Über Hardcore modes also await players who are full masters of the game and quite possibly insane.</li></ul><ul class=\"bb_ul\"><li><strong>A remixed “easy” mode</strong>  for all levels and bosses. The remixed mode is a lot easier to survive than its standard mode. The “easy” difficulty for Giana should roughly correspond to the “normal” difficulty for casual platformer games.</li></ul><ul class=\"bb_ul\"><li><strong>Extras:</strong> Halloween-themed levels accessible from the start.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/223220/header.jpg?t=1616599621","developer":"Black Forest Games","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2013,"age":0,"name":"Monaco: What's Yours Is Mine","description":"Monaco: What's Yours Is Mine is a single player or co-op heist game.  Assemble a crack team of thieves, case the joint, and pull off the perfect heist.<br><br><ul class=\"bb_ul\"><li>The Locksmith: Blue-collar infiltration expert<br></li><li>The Lookout: She can see and hear everything... a natural leader<br></li><li>The Pickpocket: A hobo with a monkey and a penchant for crime<br></li><li>The Cleaner: A silent psychopath... Jack The Ripper in pink<br></li><li>The Mole: Big and dumb... likes to tunnel<br></li><li>The Gentleman: He doesn't always wear a disguise, but when he does, he looks fantastic<br></li><li>The Hacker: Armies of viruses shut down security... a modern day warlock<br></li><li>The Redhead: Manipulative and murderous... a lady always gets what she wants</li></ul>Play with up to four people online or on the same screen. Compete with others via daily leaderboards.  Find out why it won the 2010 IGF and has been described by PCGamer as &quot;one of the best co-op games of all time.&quot;","image":"https://cdn.akamai.steamstatic.com/steam/apps/113020/header.jpg?t=1651517559","developer":"Pocketwatch Games","platforms":{"windows":true,"mac":false,"linux":true}},{"releaseYear":2013,"age":0,"name":"Antichamber","description":"Antichamber is a mind-bending psychological exploration game where nothing can be taken for granted. Discover an Escher-like world where hallways wrap around upon each other, spaces reconfigure themselves, and accomplishing the impossible may just be the only way forward.<br><br><br>Several years in the making, Antichamber received over 25 awards and honors throughout its development, in major competitions including the Independent Games Festival, the PAX10, IndieCade and Make Something Unreal. Antichamber was also supported by the Indie Fund.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li> A deeply psychological experience that will make you question everything you know about how a game works.<br></li><li> Mind-bending challenges that will subvert your expectations at every twist and turn.<br></li><li> An enormous, seamless non-Euclidean world to explore.<br></li><li> Lifelike soundscapes developed by Robin Arnott and an ambient soundtrack composed by Siddhartha Barnhoorn.<br></li><li> A gun that can create, destroy and manipulate matter, allowing you to discover new ways to overcome your surroundings.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/219890/header.jpg?t=1525832559","developer":"Alexander Bruce","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"LUFTRAUSERS","description":"The skies will be set aflame and the seas will overflow with wreckage in Vlambeer’s stylish arcade shooter LUFTRAUSERS! Select from over 125 combinations of weapons, bodies, and propulsion systems and take to the skies to battle enemy fighter planes, battleships, submarines, and rival aces for glory, honor, and high scores. Bravely volunteer for one of over 100 daring missions to unlock new Rauser combinations and vibrant color variations and become the most legendary Rauser pilot of all time!<br><br><strong>Bold Aerial Combat </strong>– White-knuckle battles against a crimson and cream sky harken back to the pure arcade shooters of the past with tight gameplay, ridiculous combos, and challenges that can only be mastered by the most elite rauser pilots in the world.<br><br><strong>Customizable Rausers</strong> – Unlock unique weapons, plane bodies, and propulsion systems to radically alter your fighter in over 125 deadly combinations. Each daring configuration not only radically alters how your rauser handles and attacks but also rearranges the dynamic soundtrack crafted by KOZILEK.<br><br><strong>Daring Missions </strong>– Make your fellow airmen proud as you tackle over 100 challenging missions from your commanding officers and face off against rival aces in a dogfight to the death. <br><br><strong>Glorious Achievements</strong> - You know, a little something to brag about on shore leave.","image":"https://cdn.akamai.steamstatic.com/steam/apps/233150/header.jpg?t=1659054136","developer":"Vlambeer","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":"16","name":"Prison Architect","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/233450/extras/header.gif?t=1654092372\" /><br><br><strong>Welcome Wardens!</strong><br><br>Only the world’s most ruthless Warden can contain the world’s most ruthless inmates. Design and develop your personalized penitentiary in Prison Architect.<br><br><i>Key Features:</i><h2 class=\"bb_tag\">Customized Confinement</h2>Allocate resources to optimize your compound, but don’t restrict the flow of the crowd lest you encounter a flood, fire, fight, or full-blown riot.<h2 class=\"bb_tag\">Invest and Innovate</h2>Tap federal money with grant applications &amp; direct your funds to combat disease, gang activity, litigation, and more!<h2 class=\"bb_tag\">Management and Muscle</h2>Ensure your prison is *mostly* ethical and safe with top-notch staff including armed guards, psychologists, doctors, lawyers and snitches.<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/233450/extras/gameplay1.gif?t=1654092372\" /><h2 class=\"bb_tag\">Detention by Design</h2>Each prisoner’s criminal history requires custom treatment programs, labor schedules, and reform workshops.<h2 class=\"bb_tag\">Lockdown Showdown</h2>Attempt a high-stakes escape of your own supermax prison in Escape Mode, or try Online mode to test one of 12,000 player-created prisons. Expand your empire limitlessly in Sandbox mode.<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/233450/extras/gameplay2.gif?t=1654092372\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/233450/header.jpg?t=1654092372","developer":"Double Eleven","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Kerbal Space Program","description":"In <strong>Kerbal Space Program</strong>, take charge of the space program for the alien race known as the Kerbals. You have access to an array of parts to assemble fully-functional spacecraft that flies (or doesn’t) based on realistic aerodynamic and orbital physics. Launch your Kerbal crew into orbit and beyond (while keeping them alive) to explore moons and planets in the Kerbol solar system, constructing bases and space stations to expand the reach of your expedition.<br><br>Kerbal Space Program features three gameplay modes. In Science Mode, perform space experiments to unlock new technology and advance the knowledge of Kerbalkind. In Career Mode, oversee every aspect of the space program, including construction, strategy, funding, upgrades, and more. In Sandbox, you are free to build any spacecraft you can think of, with all parts and technology in the game.<h2 class=\"bb_tag\">Key Features</h2><br><ul class=\"bb_ul\"><li> Build spaceships, rockets, and vehicles using any imaginable combination of parts, each with their own function that will affect the way your spacecraft behaves.<br></li><li> Take full control over your ship’s setup to execute complex flight maneuvers. <br></li><li> Manage your Kerbal crewmembers, including hiring, training, and sending them into space to become heroes. <br></li><li> Discover a whole star system with unique moons and planets, exploring detailed terrain at a vast scale. <br></li><li> Send your Kerbal crew outside their ships for “extra-vehicular” activities.<br></li><li> Dock spacecraft together to construct space stations, massive starships, and surface bases on new planets. <br></li><li> Use satellites to scan terrain and find biomes and other anomalies.<br></li><li> Set up communications networks to communicate between your spacecraft and Kerbal Space Center.<br></li><li> Research and develop new technologies to extract valuable information and resources from all over the solar system, and much more!</li></ul><br>Try out the many mods created by the Kerbal Space Program community!","image":"https://cdn.akamai.steamstatic.com/steam/apps/220200/header.jpg?t=1624555019","developer":"Squad","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Dust: An Elysian Tail","description":"Immerse yourself in a gorgeous hand-painted world on a search for your true identity. As the mysterious warrior, Dust, your action-packed journey will take you from peaceful glades to snowy mountaintops and beyond. At your disposal is the mythical Blade of Ahrah, capable of turning its wielder into an unstoppable force of nature, and the blade's diminutive guardian, Fidget. Battle dozens of enemies at once with an easy-to-learn, difficult-to-master combat system, take on a variety of quests from friendly villagers, discover ancient secrets and powerful upgrades hidden throughout the massive, open world, and uncover the story of an ancient civilization on the brink of extinction as you fight to uncover your own past.<h2 class=\"bb_tag\">Key Features</h2><br><ul class=\"bb_ul\"><li>A traditionally-animated action-adventure tale, now in gorgeous 1080p<br></li><li>An expansive world filled with unique characters, quests, and secrets<br></li><li>Action-packed nonlinear platforming rewards exploration and experimentation<br></li><li>Fully voiced cast and a deep, rewarding storyline<br></li><li>Full support for gamepad, mouse+keyboard, or keyboard-only controls<br></li><li>A wide range of performance options to cater to every PC<br></li><li>Award-winning musical score by Hyperduck Soundworks</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/236090/header.jpg?t=1577734273","developer":"Humble Hearts LLC","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Gunpoint","description":"Gunpoint is a stealth puzzle game that lets you rewire its levels to trick people. You play a freelance spy who takes jobs from his clients to break into high security buildings and steal sensitive data.<br><br>To get past security, you'll need to make creative use of your main gadget: the Crosslink. It lets you see how all the security devices in a level are wired up, and then you can just click and drag with the mouse to wire them differently. So you can connect a lightswitch to a trapdoor, then flick it when a guard walks across to make him fall through.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li> Rewire levels to work however you want<br></li><li> Trick guards into trapping themselves or shooting each other<br></li><li> Throw yourself - and others - through plate glass windows<br></li><li> Investigate a noir-inspired story of murder and espionage over 20 missions<br></li><li> Choose what to tell your clients, including lying to trick them<br></li><li> Choose your own playstyle: quick, quiet, non-violent, no living witnesses, or any combination<br></li><li> Discover new solutions to levels that no-one else has thought of<br></li><li> Buy specialist gadgets to suit how you want to play<br></li><li> All story stuff is skippable<br></li><li> Hardest puzzles are optional<br></li><li> No bosses - everyone dies in one shot, including you</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/206190/header.jpg?t=1585250076","developer":"Suspicious Developments","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"The Swapper","description":"What if someone knew your mind better than you did?<br><br>The Swapper is an award-winning, narrative driven puzzle game set in the furthest reaches of space.<br><br>The Swapper takes place in an isolated and atmospheric sci-fi world. Players wield an experimental device which allows them to create clones of themselves, swapping their entire consciousness into new bodies to overcome the challenges of the environment.<h2 class=\"bb_tag\">Key Features:</h2><ul class=\"bb_ul\"><li>Think: Fiendishly designed puzzles with equally clever solutions that are never more than a few steps away.<br></li><li>Wonder: The art in The Swapper is constructed using clay models and everyday materials, which combine to create truly unique visuals in a detailed and atmospheric environment.<br></li><li>Discover: A powerful and thoughtful story, told through the game's environment with narrative design from Tom Jubert, the writer behind hits including Driver: San Francisco and Faster Than Light.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/231160/header.jpg?t=1651857485","developer":"Olli Harjola, Otto Hantula, Tom Jubert, Carlo Castellano","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Guacamelee! Gold Edition","description":"<i>Guacamelee! Gold Edition</i> is a Metroidvania-style action-platformer set in a magical Mexican-inspired world. The game draws its inspiration from traditional Mexican culture and folklore, and features many interesting and unique characters.<br><br><i>Guacamelee!</i> builds on the classic open-world Metroidvania style of games by adding deep melee combat, a new dimension switching mechanic, and cooperative local multiplayer. The game also blurs the boundaries between combat and platforming by making many moves useful and necessary for both.<br><br>Travel through a mystical and mysterious Mexican world as a luchador using the power of your two fists to battle evil. Uncover hidden wrestling techniques like the Rooster Uppercut, and Dimension Swap to open new areas and secrets.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li>Use combat moves for both fighting enemies and platforming challenges <br></li><li>Swap between multiple overlapping dimensions (World of the Living and the World of the Dead) <br></li><li>&quot;El Infierno&quot; level expansion. Brave the fires of El Infierno and prove yourself in a series of challenges to unlock powerful new costumes for Juan and Tostada<br></li><li>Player costumes! Swap costumes to change the attributes of your Hero, and obtain new achievements<br></li><li>Steam Achievements, Leaderboards, Cloud Save, and Big Picture Mode<br></li><li>Trading Cards<br></li><li>Create new custom costumes and share these with others via Steam Workshop<br></li><li>Drop in/out 2-Player local co-operative play for the entire story <br></li><li>Chickens. Lots and lots of Chickens</li></ul><h2 class=\"bb_tag\">Also Available: Super Turbo Championship Edition!</h2><a href=\"http://store.steampowered.com/app/275390/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/214770/extras/Guacamelee_STCE_HeroBanner_616x183_ALL.jpg?t=1660051335\" /></a><br>An alternate, expanded edition of Guacamelee! is now available to Steam PC users! Guac STCE adds to the Gold Edition with extra powers, levels and enemies, and enhancements to gameplay and graphics. Click the banner to find out more.","image":"https://cdn.akamai.steamstatic.com/steam/apps/214770/header.jpg?t=1660051335","developer":"DrinkBox Studios","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Papers, Please","description":"<i><strong>Congratulations. </strong><br>The October labor lottery is complete. Your name was pulled. <br>For immediate placement, report to the Ministry of Admission at Grestin Border Checkpoint. <br>An apartment will be provided for you and your family in East Grestin. Expect a Class-8 dwelling. <br><strong>Glory to Arstotzka</strong></i><br><br><br>The communist state of Arstotzka has just ended a 6-year war with neighboring Kolechia and reclaimed its rightful half of the border town, Grestin. <br><br>Your job as immigration inspector is to control the flow of people entering the Arstotzkan side of Grestin from Kolechia. Among the throngs of immigrants and visitors looking for work are hidden smugglers, spies, and terrorists.<br><br>Using only the documents provided by travelers and the Ministry of Admission's primitive inspect, search, and fingerprint systems you must decide who can enter Arstotzka and who will be turned away or arrested.","image":"https://cdn.akamai.steamstatic.com/steam/apps/239030/header.jpg?t=1646889353","developer":"Lucas Pope","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Hammerwatch","description":"A hack and slash action adventure, set in a fantasy pixel art environment. Play solo or co-op in this adventure from bottom to top of Castle Hammerwatch. Kill hordes of enemies with varied looks and features through four unique environments with traps, hidden secrets and puzzles.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li>6 different classes, with unique features and skills<br></li><li>Character development through unlocks and upgrades<br></li><li>Hard, medium and easy of course<br></li><li>Customize difficulty with several different modifiers<br></li><li>Controller support, supports various different gamepads<br></li><li>Multiplayer COOP, for up to four players, online, LAN and local<br></li><li>PC, MAC and Linux support<br></li><li>Mod and editing support, make your own levels and change other things to your liking</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/239070/header.jpg?t=1575209264","developer":"Crackshell","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Clickteam Fusion 2.5","description":"Game and software creation has never been easier or quicker than with Clickteam Fusion 2.5! Discover the tool used by so many multimedia professionals, game creators, and creative people from all walks of life.<br><br>With CF2.5’s amazing event editor system you are able to quickly generate games or apps without mastering a traditional programming language.<br><br>Within your first hour you will have learned the basics of the tool. Compile a windows app with a mouse click, Or target additional platforms like iOS, Android, Flash and XNA (Windows Mobile phone and Xbox) with the purchase of our optional exporters. <br><br>Harness the power of Clickteam Fusion 2.5 today.<h2 class=\"bb_tag\"><strong>Steam Games #MadeWithFusion</strong></h2><br><a href=\"http://store.steampowered.com/app/319510/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Fnaf.jpg?t=1653866222\" /></a><a href=\"http://store.steampowered.com/app/298630/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Escapists.jpg?t=1653866222\" /></a><br><a href=\"http://store.steampowered.com/app/248310/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Freedomplanet.jpg?t=1653866222\" /></a><a href=\"http://store.steampowered.com/app/237740/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/AVGNA.jpg?t=1653866222\" /></a><br><a href=\"http://store.steampowered.com/app/441280/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Rebirth.jpg?t=1653866222\" /></a><a href=\"http://store.steampowered.com/app/400160/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/ConcreteJungles.jpg?t=1653866222\" /></a><br><a href=\"http://store.steampowered.com/app/274270/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/NotAHero.jpg?t=1653866222\" /></a><a href=\"http://store.steampowered.com/app/352070/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/FortMeow.jpg?t=1653866222\" /></a><br><a href=\"http://store.steampowered.com/app/314590/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/room13.jpg?t=1653866222\" /></a><a href=\"http://store.steampowered.com/app/384210/\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/quadle.jpg?t=1653866222\" /></a><h2 class=\"bb_tag\"><strong>Amazing Features from the Original Drag and Drop Programming Tool</strong></h2>-Make your first game in <u>under an hour!</u><br>-No need for previous programming knowledge<br>-Easy to use and intuitive physics engine<br>-The original and world famous Event Editor makes programming a breeze<br>-Used by professionals and students alike<br>-Shader effects available<br>-Inserting assets is as easy as drag and drop<br>-Publish games and apps for multiple platforms<br>-Complete creative flexibility<br>-Hardware accelerated games and apps<br>-Outstanding, friendly community support<h2 class=\"bb_tag\"><strong>Build for many platforms with optional exporters</strong></h2><br><table><tr>   <td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/html5.png?t=1653866222\" /></td>  <td>Generates HTML5 on the fly and runs automatically in your browser<br>Open extension SDK for endless functionality</td></tr><tr>   <td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Windows.png?t=1653866222\" /></td>    <td>Use hardware acceleration &amp; shaders on powerful Windows machines<br>100's of additional objects provide additional functionality to the tool</td></tr><tr>\t<td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/Android.png?t=1653866222\" /></td>\t<td>Build directly from CF2.5 to any of your Android devices and build APKs<br>Access the Android OS with our simple permissions management system</td></tr><tr>\t<td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/ios.png?t=1653866222\" /></td>\t<td>Build games for all iOS touch devices including iPad, iPhone and iPod<br>Maximize control options with the Accelerometer and Multitouch interface objects</td></tr><tr>\t<td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/xna.png?t=1653866222\" /></td>\t<td>Build Games for Xbox and Windows 8 Mobile<br>Multiple Control options for Multiple Platforms</td></tr><tr>\t<td><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/248170/extras/flash.png?t=1653866222\" /></td>\t<td>Produce quality Flash content in record time<br>Fully Customizable SWF Generated Easily</td>\t</tr></table>","image":"https://cdn.akamai.steamstatic.com/steam/apps/248170/header.jpg?t=1653866222","developer":"Clickteam","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2013,"age":0,"name":"SteamWorld Dig","description":"SteamWorld Dig is a platform mining adventure with strong Metroidvanian influences. Take the role of Rusty, a lone mining steambot, as he arrives at an old mining town in great need. Dig your way through the old earth, gaining riches while uncovering the ancient threat that lurks below...<br><br>After making a huge impact on the Nintendo 3DS eShop, we've decided to bring SteamWorld Dig to PC/Mac/Linux. Introducing <strong>HD graphics</strong>, achievements and more, the game has been optimized for Steam!<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\">   <li>A rich world of steam-driven robots, inspired by Steampunk and Western themes.<br>   </li><li>Explore an underground world full of secrets, treasure and terrors.<br>   </li><li>Uncover the remnants of human civilization, a degenerate race of dynamite-wielding troglodytes.<br>   </li><li>Randomized worlds with emergent gameplay.</li></ul><h2 class=\"bb_tag\">Additions</h2>Compared to the Nintendo 3DS version, this release has:<br><br><ul class=\"bb_ul\">   <li><strong>HD graphics:</strong> Beautiful, high-resolution (1080p) graphics.<br>   </li><li><strong>Gamepad support:</strong> Keyboard, gamepad - play the game your way!<br>   </li><li><strong>Achievements:</strong> Completionists rejoice!<br>   </li><li><strong>Eye candy:</strong> Animated character portraits, bloom filter and more! <br>   </li><li><strong>Trading cards:</strong> With a character set like this? Of course!</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/252410/header.jpg?t=1646137249","developer":"Image & Form Games","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2013,"age":0,"name":"Small World","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/235620/extras/SmallWorld_pageSteam_03.png?t=1660753288\" /><h2 class=\"bb_tag\">CONTROL FANTASY RACES, SET OFF TO CONQUER NEW LANDS, OVERTHROW YOUR ENEMIES AND CLAIM THE VICTORY!</h2><br>In this digital adaptation of the legendary board game, dive into a world inhabited by whimsical fantasy races.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/235620/extras/SmallWorld_pageSteam_05-min.jpg?t=1660753288\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/235620/extras/SmallWorld_pageSteam_07.png?t=1660753288\" /><br>Take control of the dwarfs, wizards, amazons, giants, orcs or even humans. Then send out your troops to battle mercilessly and conquer new regions. Make shrewd use of the special powers of your races to expand your empire and win the game! Meanwhile, weaker civilizations will be ruthlessly chased out of this Small World! Carve out your place in a world that’s too small to accommodate everyone!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/235620/extras/SmallWorld_pageSteam_09-min.jpg?t=1660753288\" /><br><br>This game of strategy and conquest can be played over and over again thanks to the nearly endless combinations of races and special powers. Whether you’re a newbie or an experienced player, you’ll love playing this classic board game with simple rules and tactical gameplay.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/235620/extras/SmallWorld_pageSteam_11_11.png?t=1660753288\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/235620/header.jpg?t=1660753288","developer":"Days of Wonder","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2014,"age":0,"name":"Goat Simulator","description":"Goat Simulator is the latest in goat simulation technology, bringing next-gen goat simulation to YOU. You no longer have to fantasize about being a goat, your dreams have finally come true! WASD to write history.<br><br>Gameplay-wise, Goat Simulator is all about causing as much destruction as you possibly can as a goat. It has been compared to an old-school skating game, except instead of being a skater, you're a goat, and instead of doing tricks, you wreck stuff. Destroy things with style, such as doing a backflip while headbutting a bucket through a window, and you'll earn even more points! Or you could just give Steam Workshop a spin and create your own goats, levels, missions, and more! When it comes to goats, not even the sky is the limit, as you can probably just bug through it and crash the game.<h2 class=\"bb_tag\">Disclaimer</h2>Goat Simulator is a completely stupid game and, to be honest, you should probably spend your money on something else, such as a hula hoop, a pile of bricks, or maybe pool your money together with your friends and buy a real goat.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li>You can be a goat<br></li><li>Get points for wrecking stuff - brag to your friends that you're the alpha goat<br></li><li>Steam Workshop support - make your own goats, levels, missions, game modes, and more!<br></li><li>MILLIONS OF BUGS! We're only eliminating the crash-bugs, everything else is hilarious and we're keeping it<br></li><li>In-game physics that bug out all the time<br></li><li>Seriously look at that goat's neck<br></li><li>You can be a goat</li></ul><h2 class=\"bb_tag\">Mac and Linux Disclaimer</h2>The Mac and Linux ports are still in Beta. Expect problems. We're working on fixing them asap!","image":"https://cdn.akamai.steamstatic.com/steam/apps/265930/header.jpg?t=1596094271","developer":"Coffee Stain Studios","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Octodad: Dadliest Catch","description":"Octodad: Dadliest Catch is a game about destruction, deception, and fatherhood. The player controls Octodad, a dapper octopus masquerading as a human, as he goes about his life. Octodad's existence is a constant struggle, as he must master mundane tasks with his unwieldy boneless tentacles while simultaneously keeping his cephalopodan nature a secret from his human family.<br><br>In this sequel to the splash hit Octodad, our cephaloprotagonist has gotten himself in a bind between his wife’s mounting mistrust, and a disastrous trip to the local aquarium! Are you dad enough to control the titular octopus father as he strives to hide his nautical nature from his family while keeping his tangled tentacles intact?<br><br>In Octo-ber 2010, a group of university students released the original Octodad into the world. Despite everyone being convinced that the game was about a normal human dad, the game was a cult hit, gained critical acclaim, and was an Independent Games Festival Student Finalist in 2011. Octodad received enough attention that the team decided to run a Kickstarter, form the game studio Young Horses, and create a bigger, better, more polished game about Octodad. Two and a half years after beginning production, Octodad: Dadliest Catch is ready to flop awkwardly into your arms.<h2 class=\"bb_tag\"><strong>Key Features</strong></h2><ul class=\"bb_ul\"><li>Octodad’s wacky physics create hilarious moments that are different every time. Be surprised by the randomness of Octodad’s flailing or express your own sense of humor by making Octodad do silly things.</li><li>An all-new adventure that explores Octodad’s world, relationships and backstory.</li><li>Complete Octodad’s sartorial style by collecting and wearing a variety of hidden neckties.</li><li>Gather family members and/or friends to control Octodad's limbs in co-op mode with 2 to 4 players. Up to 4 times the limbsanity!</li><li>Gain access to the (Windows Only) level editor that the Young Horses used to create Octodad: Dadliest Catch. Create your own ridiculous levels for Octodad to squish and flop through and submit them to Steam Workshop.</li><li>Play mod levels created by the Steam community and the creators of Octodad on Steam Workshop. (PC/Mac/Linux)</li><li>Experience Dadliest Catch’s unique control scheme with various control inputs, including X360, DualShock4, Mouse + Keyboard, Mac multitouch trackpad, Windows 8 touchscreens.  For gamepads, XInput is best supported, as DirectInput requires manual remapping in most circumstances.</li></ul><h2 class=\"bb_tag\"><strong>Soundtrack</strong></h2>Written and Produced by Seth Parker. <br>Artwork by Chris Stallman. <br><br>You can find more music from Kozilek <a href=\"https://steamcommunity.com/linkfilter/?url=http://kozilek.bandcamp.com\" target=\"_blank\" rel=\"noopener\"  >here</a>.<br>Ian McKinney's Bandcamp is <a href=\"https://steamcommunity.com/linkfilter/?url=http://ianmckinney.bandcamp.com\" target=\"_blank\" rel=\"noopener\"  >here</a>.<br>and more of Whitaker Trebella's tunes are <a href=\"https://steamcommunity.com/linkfilter/?url=http://wtrebella.bandcamp.com\" target=\"_blank\" rel=\"noopener\"  >here</a>.<br><br>If you purchased the soundtrack DLC the files will be placed in your Octodad Dadliest Catch folder in the Steam Directory: ...\\\\Steam\\\\SteamApps\\\\common\\\\Octodad Dadliest Catch\\\\Octodad Dadliest Catch Original Soundtrack\\\\ (Right click Octodad Dadliest Catch in the Games list -&gt; Local Files -&gt; Browse Local Files).","image":"https://cdn.akamai.steamstatic.com/steam/apps/224480/header.jpg?t=1579035625","developer":"Young Horses","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"South Park™: The Stick of Truth™","description":"From the perilous battlefields of the fourth-grade playground, a young hero will rise, destined to be South Park’s savior. From the creators of South Park, Trey Parker and Matt Stone, comes an epic quest to become… cool. Introducing South Park™: The Stick of Truth™.<br><br>For a thousand years, the battle has been waged. The sole reason humans and elves are locked in a neverending war: The Stick of Truth. But the tides of war are soon to change as word of a new kid spreads throughout the land, his coming fortold by the stars. As the moving vans of prophecy drive away, your adventure begins.  <br><br>Arm yourself with weapons of legend to defeat underpants gnomes, hippies and other forces of evil.  Discover the lost Stick of Truth and earn your place at the side of Stan, Kyle, Cartman and Kenny as their new friend. Succeed, and you shall be South Park’s savior, cementing your social status in South Park Elementary. Fail, and you will forever be known… as a loser.<h2 class=\"bb_tag\">Key Features</h2><ul class=\"bb_ul\"><li><strong>The Definitive South Park Experience</strong><br>Written and voiced by Trey Parker and Matt Stone, The Stick of Truth brings their unique brand of humor to video gaming.<br></li><li><strong>An Epic Quest To Become... Cool</strong><br>Earn your place alongside Stan, Kyle, Cartman and Kenny, and join them in a hysterical adventure to save South Park.<br></li><li><strong>Friends With Benefits</strong><br>Recruit classic South Park characters to your cause.<br></li><li><strong>Intense Combat</strong><br>Arm yourself to the teeth with an arsenal of magical weapons and mystical armor.<br></li><li><strong>South Park Customization</strong><br>Insert yourself into South Park with something like a billion character, clothing, and weapon combinations.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/213670/header.jpg?t=1611584789","developer":"Obsidian Entertainment","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Saves The Zoo","description":"<strong>Things have gone wild at the Cartown Zoo!</strong><br><br>Today's the grand opening of the Cartown Zoo, and there's still so much to do: zoo chow is running low, and all the baby animals are missing. Putt-Putt® and Pep need your child's help to reunite the little ones with their parents before Outback Al can open the gates. Along the way, they'll swing across alligator-infested rivers, play ice hockey with a polar bear, build a bridge out of icebergs, bop with dancing penguins, and enjoy other adventures. This zoo is full of loyal friends and captivating challenges that are sure to run wild through your child's imagination.<br><br><ul class=\"bb_ul\"><li>Take breaks from the action to play games, sing songs, paint Putt-Putt® or learn about the animals you find in the zoo.<br></li><li>Click Points reveal hundreds and hundreds of hidden surprises.<br></li><li>Use Putt-Putt's® special camera to take picture of your favorite zoo animals and print them out.<br></li><li>Out of time? You can save the game and finish it later.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >http://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294660/header.jpg?t=1578527121","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Joins the Parade","description":"<strong>What does it take to be in a parade? </strong><br><br>Hard work, a bright shiny chassis and a little help from your friends. That's what Putt-Putt® discovers as he gears up to join the annual Cartown Pet Parade. Children will be delighted as they meet the local carfolk, explore a toy shop, tool down the road and more. Along the way, they learn to think ahead, deal with unexpected problems, and give others a hand. The road to discovery has never been more fun - or more educational. Charming talking characters, lively sound effects and lifelike animation keep your child focused on the adventure.<br><br><ul class=\"bb_ul\"><li>Putt-Putt® Joins the Parade is fully-loaded with originality and activity. Even adults find it hard to resist getting in on the fun. What's more, Putt-Putt® offers lots of exciting new options every time kids play. The result is an entertaining learning experience that never gets old.<br></li><li>Surprise Click Points. There's no telling what will pop up when you click on a garage door, a magnet or even a flower. Talking fire engines and dancing mice are just some of Putt-Putt's® many roadside attractions. With so much to see, kids won't want to miss a thing.<br></li><li>Need Help? Just See Smokey. Smokey's always there to give Putt-Putt® a hand. Help screens have never been friendlier.<br></li><li>Clean Up's a Breeze. Kids help Putt-Putt® get cleaned up for the parade with a simple click of the mouse. Taking a shower is more fun than ever.<br></li><li>Moo-ve Over. Children's problem-solving skills are developed as they learn how to deal with cow roadblocks and other unexpected problems.<br></li><li>Putt-Putt® Opens Up a Helpful New World. Kids learn how to earn money and remember an address. They even learn the value of doing a good deed.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/283920/header.jpg?t=1578526913","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish and the Case of the Missing Kelp Seeds","description":"Grandma Grouper's kelp seeds are missing and without them all of the sea creatures will go hungry!<br><br>Help underwater detective Freddi Fish and her finny friend Luther solve the case. Explore underwater caves, deep canyons and colorful reefs, and discover fascinating places like King Crab's Castle and A Sunken Ship Out of Time, in an effort to save the reef. Children use logical thinking and reasoning skills as they gather information and then use what they have learned to solve the mysteries of the sea!<br><br><strong>Game Features:</strong><br><br><ul class=\"bb_ul\"><li>Help Freddi Fish and Luther find the missing seeds in 40 different places!<br></li><li>Fun discoveries await children as they explore the ocean bed with Freddi -- you never know what they'll find!<br></li><li>Kids have a great time exploring more than 500 secret click points -- a new surprise every time they play!</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >http://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/283940/header.jpg?t=1578016205","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam: No Need to Hide When It's Dark Outside","description":"Sam is an ordinary kid who, with the help of his red cape, turns into &quot;superhero&quot; Pajama Sam. In No Need to Hide When It’s Dark Outside, Pajama Sam journeys into the land of darkness (his closet) to face his fears. Help Pajama Sam figure out who or what is behind the darkness and realize that there is no need to hide when it’s dark outside!<br><br><strong>Game Features:</strong><br><br><ul class=\"bb_ul\"><li>Think, listen, explore--fun learning encourages critical thinking, fosters listening and memory skills, and reinforces good social skills.<br></li><li>Cartoon-quality learning adventure where you choose where the characters go.<br></li><li>Explore exciting locations and collect information to complete the adventure.<br></li><li>The adventure changes each time you play!</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/283960/header.jpg?t=1576519251","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Spy Fox in \"Dry Cereal\"","description":"<h2 class=\"bb_tag\">Will kids be forced to endure a fate worse than eating dry cereal!?</h2><br><strong>The Plot:</strong> William the Kid has nearly completed his dastardly plan to cow-nap all the worlds supply of milk!<br><br><strong>The Mission:</strong> The super-suave agent, SPY Fox, must find Mr. Udderly, rescue all the cows, and stop William the Kid from depleting the worlds supply of milk. Using ingenious SPY gadgets, keen wits, and daring moves, SPY Fox, jumps out on an udderly exhilarating adventure!<br><br><ul class=\"bb_ul\"><li>Innovative new tools like Talk Balloons allow kids to investigate in a whole new way<br></li><li>Use top secret SPY gadgets to solve puzzles that test logic<br></li><li>Earn clues with fun games and activities<br></li><li>Clues change every time you play, and the game just might end differently</li></ul><br>SPY Fox in Dry Cereal challenges and inspires kids to observe details and solve problems in creative and flexible ways. Kids play with faithful, lovable friends as they discover and explore captivating worlds where they direct the journey at their own pace.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/283980/header.jpg?t=1577151224","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® and Pep's Balloon-o-Rama","description":"Help Putt-Putt® bounce his pal Pep into the air to pop colorful balloons--some filled with hidden surprises!<br><br>Balloon-O-Rama features 120 levels of action and hidden bonus rounds. It even has a construction mode, so kids can build their own challenging levels! The junior arcade games are jam-packed with fast and furious game-play that will provide hours of fun.<br><br><strong>Features:</strong><br><br><ul class=\"bb_ul\"><li>Challenging arcade-style games<br></li><li>120 levels<br></li><li>Construction mode allows kids to create their own levels of balloon fun<br></li><li>Save your game after each level and track scores for up to 75 players<br></li><li>For kids ages 3 to 8</li></ul><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/284000/header.jpg?t=1578529192","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish and Luther's Maze Madness","description":"Dive in to help Freddi Fish and Luther navigate a labyrinth of underwater caves and collect the scattered kelp seeds! <br><br>Over 50 maze-crazed caverns to explore. Junior Arcade games are jam-packed with fast-and-furious gameplay that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children. <br><br><strong>Product Features:</strong><br><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for kids ages 3 to 8 (and children of all ages)<br></li><li>Action with all the quality you would expect from Humongous Entertainment<br></li><li>Save your game after each level and track the scores of up to 75 players<br></li><li>The easy-to-use Custom Level Builder allows kids to make their own a-maze-ing levels</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/284020/header.jpg?t=1578015681","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Spy Fox 2 \"Some Assembly Required\"","description":"<strong>The Plot: </strong>Once again, the world relies on Fox - Spy Fox, the suave secret agent who smoothly finesses his way through Spy Corps' toughest assignments. This time, Spy Corps' corrupt counterpart, the Society for Meaningless Evil, Larceny, Lying and Yelling (S.M.E.L.L.Y.) has devised a dogbot which will be unleashed upon the unsuspecting world! In his nastiness, S.M.E.L.L.Y.'s corrupt commander, Napoleon LeRoach, did not install an OFF switch on the dogbot. Instead, he hid the switch somewhere within the World's Fair.<br><br><strong>The Mission:</strong> Find the hidden OFF switch, deactivate the dogbot and stop LeRoach in his robotic tracks!<br><br><ul class=\"bb_ul\"><li>Experience Junior Adventures delight in the challenging puzzles and cool mini-games.<br></li><li>The secret ending is almost as elusive as SPY Fox's modesty. Can you find it?<br></li><li>Out of time, Super Sleuth? Save you game and finish it up later.<br></li><li>Think you solved the mystery for good? Play again - you may find a whole new adventure awaiting you!</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292240/header.jpg?t=1577149705","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Spy Fox 3 \"Operation Ozone\"","description":"<strong>Where would you like to go next, SPY Fox?</strong><br><br><strong>Air Today, Gone Tomorrow.</strong><br><br>A huge hairspray space station is blasting vile vapors into the ozone, putting Earth at the mercy of the sun's rays. With her paw on the nozzle, Poodles Galore unleashes her plot to corner the sunscreen market. It's up to SPY Fox and his friends to &quot;can&quot; Poodles and save the planet.<br><br><strong>Features:</strong><br><ul class=\"bb_ul\"><li>Kooky, crazy characters you'll love.<br></li><li>Interactive animations send you on out-of-this-world adventures.<br></li><li>Multiple game paths and mini-games in every corner stretch the fun.<br></li><li>The only interactive spy adventure of it's kind.<br></li><li>11 original SPY songs.</li></ul><br><strong>Save the World from the Poodle Menace!</strong><br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >http://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292260/header.jpg?t=1577150580","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Spy Fox In: Cheese Chase","description":"<strong>Grab you helmet and help SPY Fox catch Russian Blue and return the prized Limburger Cheese!</strong><br><br>That pretty blue kitty has heisted the famous fromage and it's up to kids to catch her! SPY scooters, jet-skis and ultralights are just a few of the racey rides kids need to outrun Blue's goon squad. Kids also put their creativity to the test as they construct challenging new levels using Professor Quack's Custom Level Builder!<br><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for kids ages 5 to 10 (and children of all ages)<br></li><li>Brand-new action with all the quality you'd expect from Humongous Entertainment!<br></li><li>Save your game after each level and track the scores of up to 75 players!<br></li><li></li></ul><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https/www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https/www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292280/header.jpg?t=1577150989","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Spy Fox In: Hold the Mustard","description":"101 Levels of Tomato Saving Fun!<br><br>Climb aboard to help SPY Fox save the world's ketchup supply from the evil King Konglomerate! Maneuver SPY Fox's M.E.S.S through water, space and air!<br><br><ul class=\"bb_ul\"><li>Help Spy Fox navigate his M.E.S.S. (Multiple Environment SPY ship) to collect tomato's and destroy King Konglomerate's robots.<br></li><li>Challenging arcade-style games for kids ages 5 to 10 (and children of all ages)<br></li><li>Brand-new action with all the quality you'd expect from Humongous Entertainment!</li></ul><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292300/header.jpg?t=1577151745","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam 2: Thunder And Lightning Aren't So Frightening","description":"<strong>Watch out Thunder and Lightning. Pajama Sam is coming!</strong><br><br>Join Pajama Sam, the world’s youngest superhero, as he journeys to World Wide Weather, the storm-stirring factory in the sky! Sam’s spent one too many evenings cowering under the couch, so he sets out to conquer his fear of thunderstorms. It’s amazing what he finds high above the clouds. Just as our little guy begins to learn that storms aren't as bad as they seem, Sam accidentally sends the weather system into a frenzy. Now, there is snow in Saigon and sunshine in Seattle! He'll need your child's help to explore this wonderful world filled with challenging puzzles, fun games and fantastic new friends as they help Thunder and Lightning fix the broken machines and return the world's weather to normal before Mother Nature finds out!<br><br><ul class=\"bb_ul\"><li>Play again and again. New puzzles, new friends and new challenges await each time you play!<br></li><li>Click points reveal hundreds and hundreds of hidden surprises!<br></li><li>Special games and activities encourage creativity, help teach spatial-relations and sharpen problem-solving skills.<br></li><li>Out of time? Save the game and finish it later.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=http://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >http://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292780/header.jpg?t=1641365959","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam 3: You Are What You Eat From Your Head To Your Feet","description":"<strong>Pajama Sam is off on a nutritiously edible adventure!</strong><br><br>Pajama Sam chases down some snickering cookies, only to find himself in the midst of a food squabble! The fats and the sweets are taking over Mop Top Island and an emergency peace conference has been called, but four of the delegates are missing! Now, it's your turn to spring into action to help Pajama Sam find the missing delegates, put a stop to the sticky quarrels, bring peace to Mop Top Island, and still make it home in time for dinner.<br><br><ul class=\"bb_ul\"><li>Meet friends along the way - friendly food walks, talks and even tell jokes.<br></li><li>Explore and Learn: Investigate every location. There is something new to learn with every click!<br></li><li>Interact with the characters and listen closely for clues.<br></li><li>It's a different game each time you play.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292800/header.jpg?t=1576533477","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam 4: Life Is Rough When You Lose Your Stuff!","description":"<strong>Sam's bedroom is a mess! </strong><br><br>Lost among the piles of clothes and toys is his prized comic book. Donning his red cape, Pajama Sam dives into the chaos only to land in a strange and fantastic world that resembles his messy room. Pajama Sam sets off on a series of adventures in search of his lost comic book, looking for lost socks in Agitator Lake, rounding up dust bunnies at the Dust Bunny Corral, exploring the Spilled Soda Swamp and much more. In the end, Sam finds his comic book and realizes that life wouldn't be so rough if he put away his stuff! Throughout the story, kids meet lots of interesting new friends and tackle fun challenges that will inspire them to solve problems in creative ways.<br><br><ul class=\"bb_ul\"><li>Help Sam find his comic book. <br></li><li>You will have to listen carefully for clues from the friends you meet !<br></li><li>The adventure changes each time you play.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292820/header.jpg?t=1576608297","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2014,"age":0,"name":"Pajama Sam's Sock Works","description":"<strong>Climb in and help Pajama Sam control the Sock-O-Matic Mark III, the sock-sorting dream machine the makes chores fun!</strong><br><br>Concentration is the key as Sam tries to control that crazy contraption. Chutes, pushers, slides, and swing arms are just a few of the gadgets you'll need to guide Sam's socks into the baskets. The Sock-O-Matic even has a Custom Level Builder that allows kids to create their own puzzling levels!<br><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for children of all ages.<br></li><li>Brand new action with all the quality you'd expect from Humongous Entertainment.<br></li><li>Save your game after each level and track the progress of up to 75 players.</li></ul><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292840/header.jpg?t=1576609241","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam's Lost & Found","description":"<strong>Climb aboard and join Pajama Sam as he jumps and glides through wild worlds, collecting toys, and dodging dangers along the way!</strong><br><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br><strong>Features:</strong><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for kids ages 3 to 8 (and children of all ages)<br></li><li>Brand new action with all the quality you'd expect from Humongous Entertainment<br></li><li>Special pass codes allow you to track the progress of an unlimited number of players<br></li><li>Over 100 levels of toy-toting fun</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/292860/header.jpg?t=1576608808","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish 2: The Case of the Haunted Schoolhouse","description":"<strong>So who is haunting the schoolhouse, taking the toys and practically scaring the scales off all the guppies?</strong><br><br>Good thing super-sleuths Freddi Fish and Luther are on the case. Their plan: build a trap to capture and expose the phony ghost. To reach their goal the two friends need your child's help to find a few things-and the list of items changes every time they play. Kids will dive right in to direct this undersea mystery filled with old friends, new faces and a festive sing-along soundtrack.<br><br><ul class=\"bb_ul\"><li>Like the real world, Freddi Fish's world changes every time you play.<br></li><li>Search through fascinating places like a submarine, a ship or Atlantis.<br></li><li>Out of time? You can save the game and finish it later.<br></li><li>Take breaks with Freddi Fish: play games like Crab Invaders, solve puzzles, draw pictures or just sing songs.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294530/header.jpg?t=1578010643","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish 3: The Case of the Stolen Conch Shell","description":"<strong>The Great Conch Shell has been stolen and it's up to Freddi Fish and Luther to catch the culprit!</strong><br>All is well on their tropical vacation, until our finny friends realize the Great Conch Shell is missing! Uncle Blenny can't open the Founder's Day Festival until the heralded horn has been recovered! Your child will join Freddi Fish and Luther as they explore ancient ruins, play games at a fun-filled carnival and even discover a sunken airplane while looking for clues and finding adventure. Rosy Pearl, Pierre the Tailor and Nadine the Narwhal are just a few of the fun new friends they'll meet as they follow Old Snoggy's sniffer through this tropical paradise. In the end, it's up to your child to piece the clues together and figure out who's responsible for this underwater caper!<br><br><ul class=\"bb_ul\"><li>Play again and again-new clues, new locations and new culprits await!<br></li><li>Click Points reveal hundreds and hundreds of hidden surprises.<br></li><li>Sing songs, play games, watch a luau and create your very own melodies.<br></li><li>Out of time? Save the game and finish it later.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294540/header.jpg?t=1578015100","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish 4: The Case of the Hogfish Rustlers of Briny Gulch","description":"<strong>Hey Partner, Freddi Fish and Luther need your help!</strong><br><br>Cousin Calico's prize-winning hogfish have been fiendishly fishnapped by some rowdy hogfish rustlers! Always the brave adventurers, Freddi and Luther offer to find the rustlers' secret hideout, rescue the hogfish, and wrangle those rambunctious rustlers. You can help Freddi and Luther bring justice back to Briny Gulch as you explore exciting Wild West locations, investigate captivating clues and meet adventurous new characters, like Cousin Calico, Sheriff Shrimp, Sahara Slim, and Eight Finger Phil. Most are helpful &quot;good guys,&quot; but every good Western needs a &quot;bad guy,&quot; or two...<br><br><ul class=\"bb_ul\"><li>It's a different game each time you play.<br></li><li>The more you click, the more you learn.<br></li><li>Develop important logical thinking, problem solving, and memory skills as you take an active - and interactive - role in solving the mystery of Cousin Calico's rustled hogfish.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294550/header.jpg?t=1578013106","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish 5: The Case of the Creature of Coral Cove","description":"<strong>There's more to this case than meets the eye! </strong><br><br>Join Freddi Fish and her best friend, Luther, for the grand opening of beautiful Coral Cove Park - But wait! A mysterious sea creature has been seen lurking inside. If the park is to open on time you have to help Freddi and Luther find the clues, solve the puzzles and get to the bottom of this watery predicament.<br><br><ul class=\"bb_ul\"><li>New locations and puzzles each time you play! <br></li><li>Packed with puzzles, games and activities! <br></li><li>Find the clues and collect the tools to solve the mystery! <br></li><li>Includes 11 exclusive Freddi Fish audio tracks!</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294570/header.jpg?t=1578015319","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Freddi Fish and Luther's Water Worries","description":"<strong>Dive in to help Freddi Fish and Luther keep the ocean from draining and save the sea creatures! </strong><br><br>Luther’s got to pop an ocean full of air bubbles before they make it to the surface. A souped-up slingshot, a little fancy finwork and some help from you are all he’ll need! Sea sponges, boulders and teleporting whirlpools are some of the useful tools you’ll need to succeed. Stinging jellyfish, spraying octopi and smelly seaweed are the least of Luther’s Water Worries!<br><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for kids ages 3 to 8 (and children of all ages)<br></li><li>Brand new action with all the quality you’d expect from Humongous Entertainment<br></li><li>Save your game after each level and track the scores of up to 75 players<br></li><li>Two-player mode allows Freddi Fish to get in on the action<br></li><li>Over 100 levels of fin-flapping fun!</li></ul><br>Junior Arcade games are jam-packed with fast-and-furious gameplay that satisfies kids’ hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294580/header.jpg?t=1578015915","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Goes to the Moon","description":"<strong>Purple Car Lands on the Moon!</strong><br><br>Due to a freak accident at the Fireworks Factory, Putt-Putt® is blasted to the moon. There he meets Rover, a lovely little lunar terrain vehicle left behind by the astronauts. Putt-Putt® and Rover must work together to rebuild a rocket, and accomplish a few good deeds for the Moon People before they meet the Man in the Moon and are homeward bound. Putt-Putt® Goes to the Moon teaches the benefit of cooperation and the lasting value of friendship.<br><br><strong>Putt-Putt® Goes to the Moon</strong> is an adventure game designed especially for children. Bursting with state-of-the-art animation, dazzling sound, hundreds of Click Points, and fully talking characters to thrill you and your child, Putt-Putt's® world unfolds around your child's actions - enhancing problem-solving skills and teaching valuable lessons along the way. Putt-Putt Goes to the Moon is like no other game for children or adults!<br><br><ul class=\"bb_ul\"><li>Cosmic Cooperation: Kids learn the value of cooperation as they help Putt-Putt® and his stranded pal, Rover, work together to get back to Earth.<br></li><li>It's not rocket science: Kids help Putt-Putt® and Rover move along and make choices with a simple click of the mouse. Kids' problem-solving skills are sharpened as they discover how their decisions affect what happens to the world around them.<br></li><li>Fun City: You never know what you'll unearth when you click on a moon crater, a doorway or a lunar gas tank. Aliens pop up, music starts, things explode - all the stuff kids love. With so much fun going on, they learn not to overlook a thing!<br></li><li>Putt-Putt® blasts kids off to a helpful new world: Kids learn math by counting moon crystals and learn how repeating music patterns can help them open a secret gate.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294650/header.jpg?t=1578526147","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Travels Through Time","description":"<strong>Wham BOOM BLAM boing!</strong><br><br>Mr. Firebird's time machine has gone haywire and Putt-Putt's® best pal Pep, is lost somewhere in time. Grab your compass! Putt-Putt® needs your child's help to find him. Together, they'll leap through time, explore new dimensions and discover surprising new friends. Meet Ms. Brachiosaurus - she holds the key to unlocking the secrets of the dinosaurs. See what pans out when you visit Silverado Sam, the prospector from the Old West. Be sure to check out Darien the librarian from the Future - he just may have the book you need. These are just a few of the delightful friends who will help your child reunite our pals. It's an adventure-of-the-centuries that will keep kids coming back time and time again!<br><br><ul class=\"bb_ul\"><li>Like the real world, Putt-Putt's® world changes every time you play.<br></li><li>Special games and activities test memory, challenge math skills and encourage creativity!<br></li><li>Click Points reveal hundreds and hundreds of hidden surprises.<br></li><li>Out of time? You can save the game and finish it later.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294670/header.jpg?t=1578528626","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Enters the Race","description":"<strong>Cartown racers, start your engines!</strong><br><br>Putt-Putt® and Pep are ready to take your kids on the ride of their lives! Today's the big day as our curious little convertible prepares for the Cartown 500. Redline Rick is eager to start the race, but Putt-Putt® and Pep need a few items before they are ready to roll. Kids join in the adventure as they explore brand-new Cartown locations like Torvil Tractor's farm and Rover's Rocket Drive-in, looking for a safety helmet for Pep. Old friends like Smokey the Fire Engine and Outback Al help Putt-Putt® get to the track in time for the big race. As the grand finale, kids hop behind the wheel for the first time ever as they race their favorite purple car toward the checkered flag at the Cartown Speedway!<br><br><ul class=\"bb_ul\"><li>Kids actually drive Putt-Putt® as he races the speedway!<br></li><li>A fantastic original soundtrack will have your kids dancing in their seats!<br></li><li>There are hundreds and hundreds of the fun Click Points children love!<br></li><li>Out of time? You can save the game and finish it later.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294680/header.jpg?t=1578525850","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® Joins the Circus","description":"<h2 class=\"bb_tag\">Step Right Up! </h2> <br><strong>Discover the Circus with Putt-Putt®!</strong><br><br>B.J. Sweeney needs you and Putt-Putt® to help his five main acts get ready for the show.  They will encounter challenges and have fun at the same time. <br><br>Junior Adventures challenge and inspires kids to observe details and solve problems in creative and flexible ways. Kids play with faithful lovable friends as they discover and explore captivating worlds where they direct the journey at their own pace.<br><br><strong>Product Features</strong><br><br><ul class=\"bb_ul\"><li>Problem Solving, Uh-oh! What goes into a power shake? Ivan the Semi-Strong Van can barely lift his antenna until his recipe card is pieced together.<br></li><li>Kindness, Splash! Putt-Putt® gladly patches Francine the high-diving hippo's swimming pool.<br></li><li>Teamwork, Phew! Thanks Putt-Putt®. With the larger umbrella Eunice can safely cross the high wire.<br></li><li>Friendship, Tra La! Sing under the big big top with your new circus friends!</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294690/header.jpg?t=1578526695","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt®: Pep's Birthday Surprise","description":"<strong>Happy Birthday, Pep!</strong><br><br>It's Pep's birthday and Putt-Putt® wants to surprise him with his first birthday party ever! Join Putt-Putt® as he travels through Cartown, helping various residents, reaping rewards, and gathering supplies for the party. With new friends to meet and new problems to solve, kids will love helping Putt-Putt® get everything ready in time for the big surprise--a birthday cake, presents, decorations, and friends!<br><br><ul class=\"bb_ul\"><li>Cartoon-style learning adventures where kids choose where the characters go.<br></li><li>Over 20 fun locations to explore.<br></li><li>The adventure changes each time the game is played.<br></li><li>Kids have so much fun they don't even realize they are learning.<br></li><li>Putt-Putt's® friendly and polite nature reinforces good social skills and manners.<br></li><li>Encourages critical thinking, creative problem solving, and teamwork.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294700/header.jpg?t=1578531190","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® and Pep's Dog on a Stick","description":"Jump in and help Pep collect all of the goodies before his rivals catch him! <br><br>Oil slicks, trampolines and teleporters can make Pep's journey even more unpredictable! Pep's quick with his hoppin' stick, but he'll really need to push his pace to hop from one challenging level to the next. Pigs with jet packs, bouncing bears and leaping frogs, what will Pep face next?<br><br><ul class=\"bb_ul\"><li>Challenging, arcade-style games for kids ages 3 to 8 (and children of all ages)<br></li><li>Brand new action with all the quality you'd expect from Humongous Entertainment<br></li><li>Save your game after each level and track the scores of up to 75 players<br></li><li>Over 100 levels of hound-hopping fun</li></ul><br>Junior Arcade games are jam packed with fast-and-furious game-play that satisfies kids' hunger for action and surprises! Starring lovable characters and the high-quality, hand-drawn animation that families have come to expect from Humongous Entertainment, this series will provide hours of action and fun for your children.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294710/header.jpg?t=1578530715","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Putt-Putt® and Fatty Bear's Activity Pack","description":"<strong>15 educational and fun-filled activities!</strong><br><br>Now, two of your child's favorite friends have come together to offer an enchanting collection of 15 traditional, educational and fun-filled activities. Putt-Putt® and Fatty Bear invite children to exercise their minds or just have fun! Putt-Putt® and Fatty Bear's Activity Pack helps kids learn through experimentation, exploration and play. Combining established learning techniques with lovable characters, lively animations, colorful graphics and brilliant sounds, the activity pack provides a positive, safe and challenging environment for children and adults. Putt-Putt® and Fatty Bear's Activity Pack also includes a collection of classic games designed to enhance early learning skills.<br><br><ul class=\"bb_ul\"><li>Put your best strategy to work while playing Go Fish!, a great beginner's card game.<br></li><li>Learn about colors and numbers while challenging Putt-Putt® to a game of On-ramps and Off-ramps, Putt-Putt's® version of the Snakes and the Ladders game.<br></li><li>Take your best shot in Tic-Tac-Toe.<br></li><li>Build logic and reasoning skills with Checkers, Reversi and Lines and Boxes.<br></li><li>Enhance memory and object recognition with Word Hunt, Cheese King and Remember.<br></li><li>Learn colors, shapes and eye-hand coordination with Paint Set, Tangrams and Circus Stormin'.<br></li><li>Create your own Pinball machine - drop the marbles and see what happens.<br></li><li>Use the Circus Puzzle Blocks to create hilarious pictures and scenes of circus acts.</li></ul><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/294720/header.jpg?t=1578528800","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Pajama Sam: Games to Play on Any Day","description":"<strong>Hours of fun and games with a superhero twist!</strong><br><br>Pajama Sam, star of award-winning adventure games, continues to challenge and inspire kids. Now your child can play all day, the superhero way, with a collection of 10 unique play experiences based on classic games and puzzles.<br><br><ul class=\"bb_ul\"><li>STRATEGIC THINKING: Capture your opponent's beans!<br></li><li>CONCENTRATION: Memorize and match the squares!<br></li><li>COUNTING: Race to the top to win!<br></li><li>PROBLEM SOLVING: Complete the picture puzzle!</li></ul><br>This product uses ScummVM across Windows, Mac and GNU/Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/317020/header.jpg?t=1576611564","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2014,"age":0,"name":"Fatty Bear's Birthday Surprise","description":"<strong>Help Fatty Bear and His Friends Cook Up A Birthday You'll Never Forget!</strong><br><br>Kids are wrapped up for hours in this fun-filled midnight adventure.<br><br>What if you had just a few short hours to put together the best birthday party ever? Help Fatty Bear, Matilda Rabbit and Gretchen the Doll work together through the night to prepare a surprise party for Kayla. There's so much to do! Find ingredients for the cake, decorate - plus stop a pesky puppy who keeps running off with their stuff. Children can't resist having a whole houseful of fun things to see and explore. It's a recipe for discovery, laughter and learning, all in one. Delightful talking characters and enchanting animation keep your child fascinated, time after time.<br><br><strong>Fatty Bear's Birthday Surprise</strong> is so entertaining and original, kids will have a hard time keeping adults out of Kayla's kitchen. What's more, Fatty Bear features hours of activity and learning that is always fresh, never boring. Kids meet up with exciting new surprises every time they play. Surprise Click Points. Click on a toy, a piano, a cabbage or just about anything, and watch what happens. Things come to life, play music, dance, fly and more. It's a magical world kids will delight in every time they play.<br><br><ul class=\"bb_ul\"><li><strong>Fatty Bear Brings a Lot to the Party.</strong> Get to know the alphabet by finding missing letters, or learn how to count by bowling and blowing up balloons.<br></li><li><strong>It's a Piece of Cake.</strong> Perception and memory skills are developed as kids help Fatty Bear, Gretchen and Matilda get it all together for the party with a simple click of the mouse. <br></li><li><strong>Just One of The Party's High Points</strong>. A tea set, a pulley and a telescope that really works! Isn't Kayla's treehouse a fun place to explore?<br></li><li><strong>Look What's Cookin'</strong> A loose puppy, a stuffed refrigerator and a flying rabbit are just some of the ingredients you'll find in this kitchen!<br></li><li><strong>Surprise Click Points.</strong> Click on a toy,a piano, a cabbage or just about anything, and watch what happens. Things come to life, play music, dance, fly and more. It's a magical world kids will delight in every time they play.</li></ul><br>This product uses ScummVM across Windows, Mac and GNU/Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/317030/header.jpg?t=1578016479","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Let's Explore the Airport (Junior Field Trips)","description":"Let Buzzy the Knowledge Bug take your kids on a fun-filled tour of their favorite places!<br><br>Let's Explore the Airport captures all of the fun, energy, and excitement of a real, working airport. Kids can check out the ticket counter in the main terminal, work the controls in the cockpit of the Concord, and see how the ground crew prepares the planes. Players can even sneak behind the scenes and find out where the baggage really goes. And that's just the beginning of this incredible tour.<br><br>Junior Field Trips turns kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to come back to <strong>The Airport</strong> again and again. It's a place where curiosity and understanding reach new heights - and the fun never stops.<br><br><strong>Get Ready to Board!</strong><br>The Airport has over 40 incredible locations to explore. Just point and click and your own your way.<br><br><strong>Meet your Tour Guide.</strong><br>Buzzy the Knowledge Bug is your official Airport guide. He'll show you where the throttle is, tell you how radar works,- and even tell you what an altimeter is! All at the push of a button.<br><br><strong>Every picture tells a story.</strong><br>More than 200 jobs, machines, tools and other objects are defined and explained in detail. Just click the mouse button and Buzzy reads the descriptions out loud.<br><br><strong>Surprise click points.</strong><br>There's no telling what will happen when you click on a float plane, the control tower, the heliport and more! Things transform and create a lively world of sights and sounds that children love.<br><br><strong>Learning has never been so much fun.</strong><br>Kids can go on a scavenger hunt, track luggage through a baggage maze, color pictures, learn fun facts, and match items with words- all in 5 fun-filled games.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/363050/header.jpg?t=1578532526","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Let's Explore the Farm (Junior Field Trips)","description":"All the fun of a field trip without leaving home!<br><br>The Farm captures all the fun, energy and excitement of a real working farm. Kids can visit the big red barn and watch a cow being milked. Take a peek inside the chicken coop and find out where eggs come from. Help harvest the corn and feed the pigs. Don't miss the pond- there's a beaver dam to explore. And that's only the beginning.<br><br>Junior Field Trips turn kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to visit The Farm again and again. It's a place where understanding and experience grow and fun never ends. <br><br>Let Buzzy the Knowledge Bug guide your child on a fun-filled trip to the farm!<br><br><strong>Meet your tour guide.</strong><br>Buzzy the Knowledge Bug is your official Farm guide. He'll tell you all about the farm animals, how crops grow, and what's cooking on the farmhouse stove. All at the push of a button.<br><br><strong>Let your child's natural curiosity run free!</strong><br>What is a silo used for? How does a well work? Why do pigs wallow in mud? The answers to these and hundreds of other questions are just a click away.<br><br><strong>Just about everything has a story.</strong><br>More than 215 animals, plants, tools and machines are defined and explained in detail. Click on the screen and Buzzy will read the description out loud.<br><br><strong>Surprise click points.</strong><br>You never know what's going to happen when you click on apples in the orchard, the pulley in the barn, or the grinder in the mill. Things transform and create a magical world children love.<br><strong><br>Learning has never been so much fun.</strong><br>Through exploration, experimentation, and play- kids improve their spelling, test their memory skills, learn how to mix colors, and enhance their dexterity and vocabulary- all in 5 fun-filled games.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/363060/header.jpg?t=1578533136","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Let's Explore the Jungle (Junior Field Trips)","description":"No place on Earth is more mysterious or exciting than a jungle. Explore the dim interior of an Amazon cave. Dive into a river and take a swim with a hippo. View the inner workings of an underground ant nest. With Let's Explore the Jungle, children become involved and intrigued from the very first scene.<br><br>Spellbound and entranced, the only limitation to your child's involvement with Let's Explore the Jungle is their own endless curiosity and imagination. Travel through over 30 jungle places. Explore 215 detailed jungle descriptions. Interact with as endless array of click-points- see for yourself what happens when they click on the orchid-mantis, the flying fox, or the orangutan. Your child is in control.<br><br>Junior Field Trips turn kids loose to discover exciting new places up close and on their own. Children decide where they want to go and how much they want to know. Detailed explanations, lively sound effects and colorful animation make every trip truly one of a kind. Kids will want to visit The Jungle again and again. It's a place where curiosity and knowledge are the keys to fun and adventure.<br><br>Let your child begin a fascinating and educational journey to the jungles of the world.<br><br><strong>Buzzy the Knowledge Bug is your guide to fun.</strong><br>You're in control from the very beginning, with Buzzy the Knowledge Bug along for the ride. This trusty blue companion appears at the click of a button, telling jokes, pointing out interesting facts, and talking about more than 200 plants and animals.<br><br><strong>It's three jungles in one!</strong><br>Discover the plants and animals of the world's three major jungles: Africa, Amazon and Asia. From the depths of a river to jungle canopy high above, hundreds of entertaining click-points are waiting to be discovered.<br><br><strong>Information is just a click away.</strong><br>215 Detailed descriptions of jungle plants and animals are available at the click of a button. Learn where chocolate comes from, why the giant anteater walks on its knuckles, or how the flying snake flies.<br><br><strong>Learning is more than an adventure- it's great games too!</strong><br>Go on a jungle scavenger hunt, improve your spelling, paint jungle pictures, or test your knowledge of jungle lore. Multiple difficulty levels make the games challenging and fun for everyone.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2.<br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a><br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/363070/header.jpg?t=1578533606","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Big Thinkers Kindergarten","description":"Big Thinkers! Kindergarten is the perfect learning supplement to your child's classroom experience. Ben and Becky Brightly's contagious wonder and ability to transform themselves into a variety of shapes and forms engage kids in a fun world of learning and discovery unlike any they have experienced before. Your little learners always feel successful as they collect oodles of SmartStars. All of their efforts and successes are rewarded on their way in the SuperStar of Smarts Challenge. Your children are in control as they laugh along while the Brightly twins bend and stretch to provide activities that help kids learn all the skills necessary for success in kindergarten.<br><br>The Brightly twins provide 16 fun new activities to help your kindergartner learn:<br><br><ul class=\"bb_ul\"><li>First Letter Identification<br></li><li>Measurement and Estimation<br></li><li>Sequencing and Patterning<br></li><li>Spelling and Phonics<br></li><li>Time Telling<br></li><li>Alphabet Skills<br></li><li>Reading and Sentences<br></li><li>Counting and Computation<br></li><li>Geography and Directions<br></li><li>Environmental Science<br></li><li>Thinking Skills<br></li><li>Spatial Perception<br></li><li>Art Creativity<br></li><li>Music Creativity</li></ul><br>Kids can do amazing things when they think big!<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2. <br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a> <br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/376760/header.jpg?t=1578517524","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Big Thinkers 1st Grade","description":"Humongous Entertainment presents Big Thinkers!, the first educational products with personality – well, actually, two personalities. Ben and Becky Brightly, the superstar twins of learning and laughter, guarantee fun as they create ways for your child to master the lessons essential to success in first grade. The tumbling, twisting twins don't just host the curriculum-based activities, they are the activities as Ben and Becky flex and form into animals, airplanes, globes and other amazing shapes to help your children collect SmartStars, fill their Brain Banks, and demonstrate that your kids can do amazing things when they think big.<br><br><ul class=\"bb_ul\"><li>16 fun activities to help your first grader learn amazing things.<br></li><li>Your kids just may be ready for the circuit in Light Bulb Math.<br></li><li>Everyone wins when they play First, Middle, or Last, the fun phonics game show.<br></li><li>Even Ben and Becky's garage is full of fun things to do!<br></li><li>Addition and subtraction are the games as kids buy Ben's Bargains.<br></li><li>Rewards are in store once kids have collected enough SmartStars to take on the SuperStar of Smarts Challenge.<br></li><li>All the animals get in the act when Ben and Becky become the Barnyard Band.<br></li><li>SmartCharts allow you to track each child's progress.<br></li><li>Kids always feel successful as all of their efforts are rewarded with SmartStars<br></li><li>The pantry's the place as kids arrange the jars in Shelf Shuffle.<br></li><li>Ben plunges into the art world as your children create their own Murals.<br></li><li>Kids help pickup the pieces of the customizable jigsaw puzzles.</li></ul><br>Think 'n' Go ensures that your child's favorite activities are never more than a couple of clicks away.<br><br>Kids can use the simple interface to print out their favorite screens and activities.<br><br>Adjustable difficulty levels allow many activities to grow with your child.<br><br>Big Thinkers 1st Grade is the perfect learning supplement to your child's classroom experience. Ben and Becky Brightly's contagious wonder and ability to transform themselves into a variety of shapes and forms engage kids in a fun world of learning and discovery unlike any they have experienced before.<br><br>Your little learners always feel successful as they collect oodles of SmartStars. All of their efforts and successes are rewarded on their way to the Superstar of Smarts Challenge. Your children are in control as they laugh along while the Brightly twins bend and stretch to provide activities that help kids learn all the skills necessary for success in first grade.<br><br>This product uses ScummVM across Windows, Mac and Linux which is released under the GNU GPL v2. <br>For more information, please visit - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.scummvm.org\" target=\"_blank\" rel=\"noopener\"  >https://www.scummvm.org</a> <br>The GNU GPL can be viewed here - <a href=\"https://steamcommunity.com/linkfilter/?url=https://www.gnu.org/licenses/gpl-2.0.html\" target=\"_blank\" rel=\"noopener\"  >https://www.gnu.org/licenses/gpl-2.0.html</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/376770/header.jpg?t=1578517336","developer":"Humongous Entertainment","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":null,"age":0,"name":"Sniper Elite V2","description":"In the dark days of the end of World War Two amidst the ruins of Berlin, one bullet can change history…<br><br>Sniper Elite V2 is an award-winning and authentic World War II sniping experience. You are elite US sniper Karl Fairburne. Parachuted into Berlin amidst the Germans’ final stand, your mission is to prevent Nazi V2 rocket program technology from falling into the hands of the besieging Red Army. You must aid key scientists keen to defect to the US, and terminate those who would help the Russians.<br><br>Take advantage of authentic weaponry, learn how to stalk your targets, fortify your position, set up the shot, use your skill, patience and cunning to achieve your mission.  Stealth gameplay is the key as you find yourself trapped between two desperate armies in a race against time. <br><br>Watch as the celebrated ‘bullet cam’ from Sniper Elite returns, bloodier and more gruesome than ever – skilful shots are rewarded with a slow-motion flight of the bullet, then targets are graphically rendered in X-Ray as the bullet enters and destroys your victim. Organs shred, bones splinter, teeth shatter, as the true impact of the sniper’s bullet is brought to life.<br><br>As World War Two ends and the Cold War begins, every shot counts. Use it wisely.<h2 class=\"bb_tag\">Key features:</h2><ul class=\"bb_ul\"><li><strong>Sniping Simulation</strong> - Sniper Elite V2 features detailed sniping simulation with advanced ballistics, taking into account gravity, wind, velocity, bullet penetration, aim stability and more. Guaranteed to provide players with the most realistic simulation of military sharpshooting yet available.<br></li><li><strong>X-Ray Kill Cam</strong> - Amazing ‘kill cam’ technology showcases what really happens when a bullet enters an enemy’s body, allowing players to see hearts and lungs tear, livers burst, and bones shatter.<br></li><li><strong>Authenticity</strong> - The game features authentic World War II Berlin locations as well as vehicles, weapons such as the Springfield M1903 the Gewehr 43 and the Mosin-Nagant 1891/30, and uniforms modeled after the original versions.<br></li><li><strong>Use the Environment</strong> - The slightest changes in the environment need to be taken into account to move into the perfect position, observe the quarry, take the shot and slip away unnoticed.<br></li><li><strong>Sniper's Choice</strong> - Players will often find themselves facing a choice of the perfect shot that leaves them catastrophically exposed or a more difficult route that means they can continue their mission.<br></li><li><strong>Multiplayer Game Types</strong> - Team Deathmatch, Deathmatch, Team Distance King, Distance King, Team Dogtag Harvest, Dogtag Harvest and Capture the Flag.</li></ul><h2 class=\"bb_tag\">New Content Available For Your Game!</h2>Since its release, Sniper Elite V2 has been continually supported by Rebellion, adding new features and content - <u>including an additional 10 free multiplayer maps</u>.<br><br>Four additional single-player mission packs are available for purchase, including the ultimate sniping mission - <u>Kill Hitler</u>. Each DLC pack also contains 2 new authentic weapons for your arsenal.","image":"https://cdn.akamai.steamstatic.com/steam/apps/63380/header.jpg?t=1601483610","developer":"Rebellion","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2013,"age":0,"name":"Gone Home","description":"<strong>June 7th, 1995. 1:15 AM</strong><br><br>You arrive home after a year abroad. You expect your family to greet you, but the house is empty. Something's not right. Where is everyone? And what's happened here?  Unravel the mystery for yourself in Gone Home, a story exploration game from The Fullbright Company.<br><br>Gone Home is an interactive exploration simulator. Interrogate every detail of a seemingly normal house to discover the story of the people who live there. Open any drawer and door. Pick up objects and examine them to discover clues. Uncover the events of one family's lives by investigating what they've left behind.<br><br><strong>Go Home Again.</strong><h2 class=\"bb_tag\">Key Features</h2><br><ul class=\"bb_ul\"><li> <strong>A Personal Story</strong>: Created by veterans of the BioShock series and the story team behind Minerva's Den, Gone Home offers the rich, nuanced details of one family's struggles to deal with uncertainty, heartache, and change.<br><br></li><li> <strong>An Immersive Place</strong>: Return to the 1990s by visiting a home where every detail has been carefully recreated, and the sounds of a rainstorm outside wrap you in the experience.<br><br></li><li> <strong>No Combat, No Puzzles</strong>: Gone Home is a nonviolent and puzzle-free experience, inviting you to play at your own pace without getting attacked, stuck, or frustrated. This house wants you to explore it.<br><br></li><li> <strong>Fully Interactive Investigation</strong>: Discover what's happened to the Greenbriars by examining a house full of the family's personal possessions, and the notes and letters they've left behind. Use your powers of observation to piece together a story that unfolds as you explore.<br><br></li><li> <strong>Behind-The-Scenes Commentary</strong>: Over 90 minutes of commentary by the developers, musicians, and voice talent behind Gone Home. Access Commentary mode by clicking the Modifiers button when starting a new game!</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/232430/header.jpg?t=1642456987","developer":"Fullbright","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2017,"age":0,"name":"LEGO® Worlds","description":"EXPLORE. DISCOVER. CREATE. TOGETHER. LEGO® Worlds is an open environment of procedurally-generated Worlds made entirely of LEGO bricks which you can freely manipulate and dynamically populate with LEGO models. Create anything you can imagine one brick at a time, or use large-scale landscaping tools to create vast mountain ranges and dot your world with tropical islands.  Drop in prefabricated structures to build and customize any world to your liking.  Explore using helicopters, dragons, motorbikes or even gorillas and unlock treasures that enhance your gameplay.  Watch your creations come to life through characters and creatures that interact with you and each other in unexpected ways.  In LEGO Worlds, anything is possible!  <br><br><a href=\"https://steamcommunity.com/linkfilter/?url=https://go.wbgames.com/privacy-center\" target=\"_blank\" rel=\"noopener\"  >https://go.wbgames.com/privacy-center</a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/332310/header.jpg?t=1637713521","developer":"TT Games","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2015,"age":0,"name":"Mayan Death Robots","description":"Mayan Death Robots reinvents the artillery genre (think Worms) in a Mayan setting invaded by alien killing machines. Pick a robot from the roster and enter the arena to destroy your opponent's power core. Aim your weapon before the timer runs out, but don't be distracted by the pretty scenery: when the rockets start flying, you already need to plan your next move! Will you choose to move your robot to a better vantage point, or will you build defenses to keep your opponent from landing a killing blow?<h2 class=\"bb_tag\"><strong>Features:</strong></h2><ul class=\"bb_ul\"><li><h2 class=\"bb_tag\">Patience is not a virtue</h2>You never have to wait for your next turn. Each player acts at the same time, so whenever you fire a shot, expect to have the favour returned. Think Worms, but everyone takes their turn at the same time!<br><br></li><li><h2 class=\"bb_tag\">Choose wisely</h2>Pick a robot with unique abilities and weapons form a roster of ten lethal killing machines. Nuke, zap, implode, incinerate and destroy the opposition with your favourite robot and fighting style!<br><br></li><li><h2 class=\"bb_tag\">Practice organized religion</h2>Your tribe of tiny Mayas thinks you are a god descended from heaven, so they worship you and aid you in battle. Give them something to really believe in and blow up the enemy robot and his tribe!<br><br></li><li><h2 class=\"bb_tag\">Muscle out the competition</h2>The actual Mayan gods don’t take your blasphemy lightly and come to crash the party. Set aside your differences and team up with your opponent to defeat massive bosses! Feel free to proceed with the face melting afterwards.<br><br></li><li><h2 class=\"bb_tag\">Care for the environment</h2>Use your construction gun to build defences or create a vantage point to rain death on your opponent.<br><br></li><li><h2 class=\"bb_tag\">Survival of the fittest</h2>Think you know what it takes to defeat your opponent? Your robot overlords have some surprises in store to keep you on your toes. Play through the campaign mode to unlock new robots and scenarios that change the way you play the game.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/347470/header.jpg?t=1478594622","developer":"Sileni Studios","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2015,"age":0,"name":"Cities: Skylines","description":"<strong>Cities: Skylines</strong> is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience. You’re only limited by your imagination, so take control and reach for the sky!<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/255710/extras/Steam-Gif-Basegame-1-Challenging-Simulation.gif?t=1661180351\" /><h2 class=\"bb_tag\">Multi-tiered and challenging simulation</h2>Constructing your city from the ground up is easy to learn, but hard to master. Playing as the mayor of your city you’ll be faced with balancing essential requirements such as education, water electricity, police, fire fighting, healthcare and much more along with your citys real economy system. Citizens within your city react fluidly, with gravitas and with an air of authenticity to a multitude of game play scenarios.<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/255710/extras/Steam-Gif-Basegame-2-Extensive-Local-Traffic-Simulation.gif?t=1661180351\" /><h2 class=\"bb_tag\">Extensive local traffic simulation</h2>Colossal Order's extensive experience developing the Cities in Motion series is fully utilized in a fully fleshed out and well-crafted local traffic simulation.<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/255710/extras/districts-policies-v2.gif?t=1661180351\" /><h2 class=\"bb_tag\">Districts and Policies</h2>Be more than just an administrator from city hall. Designating parts of your city as a district results in the application of policies which results in you rising to the status of Mayor for your own city.<br><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/255710/extras/Steam-Gif-Basegame-4-Utilize-the-day-_-night-cycle.gif?t=1661180351\" /><h2 class=\"bb_tag\">Utilize the Day and Night Cycle</h2>The city changes during the hours of the day and affects citizen schedules. Traffic is visibly slower at night and some zoned areas do not work with full efficiency. Cities: Skylines will put you in control of managing the different aspects of the day and night cycles.<h2 class=\"bb_tag\">Extensive modding support</h2>Build or improve on existing maps and structures. You can then import your creations into the game, share them as well as download the creations of other city builders on the Steam workshop.","image":"https://cdn.akamai.steamstatic.com/steam/apps/255710/header.jpg?t=1661180351","developer":"Colossal Order Ltd.","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2011,"age":0,"name":"Dead Space™ 2","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/47780/extras/terror.png?t=1614961955\" /><br><br>In Dead Space™ 2, you join Isaac Clarke, the Systems Engineer from Dead Space, as he wakes up three years after the horrific events on the USG Ishimura. The Ishimura was a Planetcracker-class starship besieged by grotesque reanimations of its dead crew, known as “Necromorphs.”<br><br>After unearthing a strange artifact known as the Marker, Isaac finds himself on the Sprawl, a giant space station in orbit around Saturn. Unable to remember how he got here and plagued with demented visions of his dead girlfriend Nicole, he must survive another nightmarish outbreak of Necromorphs as he fights his way towards an answer he hopes will end all the chaos.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/47780/extras/DEDSP2CEart4.jpg?t=1614961955\" /><h2 class=\"bb_tag\">Key Features:</h2><ul class=\"bb_ul\"><li>Tear through space with full 360 degree movement.<br></li><li>Wield a set of devastating tools to bring the terror to space. Impale Necromorphs into the walls with the Javelin, use improved telekinesis to turn limbs into deadly weapons, plant powerful dismembering trip mines, or create a hull-breach to suck a group of monsters out into space.<br></li><li>Fire up Isaac’s suit boosters to rocket around in zero gravity like never before. Explore the depths of the Sprawl and encounter new weightless combat and physics-based puzzles with full 360⁰ movement.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/47780/header.jpg?t=1614961955","developer":"Visceral Games","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2015,"age":0,"name":"Splendor","description":"The OFFICIAL digital adaptation of the best-selling board game Splendor.<br>In Splendor, you embody a rich merchant during the Renaissance. You will use your resources to acquire mines, transportation methods, and artisans who will allow you to turn raw gems into beautiful jewels, attract nobles and earn prestige.<br><br>Press Reviews and awards:<br>** Spielbox: &quot;&quot;The app is a sparkling jewel…&quot;&quot;<br>** Pocket Tactics: &quot;&quot;... I’m not sure there’s a better looking board game app on the market.&quot;&quot;<br>** Pocket Gamer: &quot;&quot;... it's a sure-fire winner.&quot;&quot;<br>** Forbes: &quot;&quot;...high replay value. Looks and sounds great, plays smoothly...&quot;&quot;<br>** Play Board Games: &quot;&quot;The Splendor App is pretty splendid...&quot;&quot;<br>** Purple Pawn: &quot;&quot;The quality of the tabletop-to-mobile adaptation is first-rate.&quot;&quot;<br>** Honor: Best Board Game App 2015 (BoardGameGeek)<br>** Received the award of the Golden Geek Best Board Game App 2015<br><br>The digital version of Splendor faithfully adapts all the various elements of the Space Cowboys’ award-winning board game:<br><br><ul class=\"bb_ul\"><li> Fast and easy to learn, yet hard to master.<br></li><li> Lavish graphics and cards, true to the original game.<br></li><li> “Renaissance” graphical and musical ambiance.<br></li><li> Solo mode, pass &amp; play and online multiplayer (2 to 4 players).<br></li><li> An exclusive game mode: scenario-based “Challenges”.<br></li><li> Historically-accurate background stories for Challenges set in the 15th to 16th centuries.<br></li><li> Multiple types of Artificial Intelligence, based on unique strategy behaviors instead of difficulty.<br></li><li> 3-minute step-by-step interactive tutorial to learn the game and digital interface.<br></li><li> Achievements board.<br></li><li> Worldwide leaderboards and rank system by connecting with a Days of Wonder account.</li></ul><br>Splendor introduces a special game mode, called Challenges. Challenges are based on historical events and anecdotes of the 15th and 16th centuries, setting up a real scenario in various places across the world. They teach you advanced techniques and offer rules variants. They put the player in unique situations with a goal to reach. Either earn a certain number of points or pick up a special card combination, in a limited time or limited number of moves.<br>Become a game expert and achieve 48 challenges along the trading routes of the world (Madrid, St. Petersburg…), not to mention duels facing  great historical figures such as Charles V or Marie Stuart.<br><br>Keep on the adventure with Splendor's Expansions : <strong>The Cities and The Strongholds</strong><br><br><br>Languages available: English, French, German","image":"https://cdn.akamai.steamstatic.com/steam/apps/376680/header.jpg?t=1660768479","developer":"Days of Wonder","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2015,"age":0,"name":"Undertale","description":"Welcome to UNDERTALE. In this RPG, you control a human who falls underground into the world of monsters. Now you must find your way out... or stay trapped forever. <br><br><i>((Healthy Dog's Warning: Game contains imagery that may be harmful to players with photosensitive epilepsy or similar condition.))</i><h2 class=\"bb_tag\">features:</h2><br><ul class=\"bb_ul\"><li> Killing is unnecessary: negotiate out of danger using the unique battle system.<br></li><li> Time your attacks for extra damage, then dodge enemy attacks in a style reminiscent of top-down shooters.<br></li><li> Original art and soundtrack brimming with personality.<br></li><li> Soulful, character-rich story with an emphasis on humor.<br></li><li> Created mostly by one person. <br></li><li> Become friends with all of the bosses!<br></li><li> At least 5 dogs.<br></li><li> You can date a skeleton.<br></li><li> Hmmm... now there are 6 dogs...?<br></li><li> Maybe you won't want to date the skeleton.<br></li><li> I thought I found a 7th dog, but it was actually just the 3rd dog.<br></li><li> If you play this game, can you count the dogs for me...? I'm not good at it.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/391540/header.jpg?t=1579096091","developer":"tobyfox","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2016,"age":0,"name":"Stardew Valley","description":"Stardew Valley is an open-ended country-life RPG! <br><br> <img src=\"https://cdn.akamai.steamstatic.com/steam/apps/413150/extras/animalStrip2.png?t=1608624324\" /><br><br>You've inherited your grandfather's old farm plot in Stardew Valley. Armed with hand-me-down tools and a few coins, you set out to begin your new life. Can you learn to live off the land and turn these overgrown fields into a thriving home? It won't be easy. Ever since Joja Corporation came to town, the old ways of life have all but disappeared. The community center, once the town's most vibrant hub of activity, now lies in shambles. But the valley seems full of opportunity. With a little dedication, you might just be the one to restore Stardew Valley to greatness!<br><br><strong>Features </strong><br><ul class=\"bb_ul\"><li><strong>Turn your overgrown field into a lively farm!  </strong> Raise animals, grow crops, start an orchard, craft useful machines, and more! You'll have plenty of space to create the farm of your dreams. <br><br></li><li><strong>4 Player Farming!</strong> Invite 1-3 players to join you in the valley online! Players can work together to build a thriving farm, share resources, and improve the local community.  As more hands are better than one, players have the option to scale profit margin on produce sold for a more challenging experience.<br><br></li><li><strong>Improve your skills over time. </strong> As you make your way from a struggling greenhorn to a master farmer, you'll level up in 5 different areas: farming, mining, combat, fishing, and foraging. As you progress, you'll learn new cooking and crafting recipes, unlock new areas to explore, and customize your skills by choosing from a variety of professions. <br><br></li><li><strong>Become part of the local community. </strong> With over 30 unique characters living in Stardew Valley, you won't have a problem finding new friends! Each person has their own daily schedule, birthday, unique mini-cutscenes, and new things to say throughout the week and year. As you make friends with them, they will open up to you, ask you for help with their personal troubles, or tell you their secrets! Take part in seasonal festivals such as the luau, haunted maze, and feast of the winter star. <br><br></li><li><strong>Explore a vast, mysterious cave. </strong> As you travel deeper underground, you'll encounter new and dangerous monsters, powerful weapons, new environments, valuable gemstones, raw materials for crafting and upgrading tools, and mysteries to be uncovered. <br><br></li><li><strong>Breathe new life into the valley.</strong> Since JojaMart opened, the old way of life in Stardew Valley has changed. Much of the town's infrastructure has fallen into disrepair. Help restore Stardew Valley to it's former glory by repairing the old community center, or take the alternate route and join forces with Joja Corporation.<br><br></li><li><strong>Court and marry a partner to share your life on the farm with. </strong> There are 12 available bachelors and bachelorettes to woo, each with unique character progression cutscenes. Once married, your partner will live on the farm with you. Who knows, maybe you'll have kids and start a family?<br><br></li><li><strong>Spend a relaxing afternoon at one of the local fishing spots. </strong> The waters are teeming with seasonal varieties of delicious fish. Craft bait, bobbers, and crab pots to help you in your journey toward catching every fish and becoming a local legend! <br><br></li><li><strong>Donate artifacts and minerals to the local museum. </strong><br><br></li><li><strong>Cook delicious meals and craft useful items to help you out.  </strong>With over 100 cooking and crafting recipes, you'll have a wide variety of items to create. Some dishes you cook will even give you temporary boosts to skills, running speed, or combat prowess. Craft useful objects like scarecrows, oil makers, furnaces, or even the rare and expensive crystalarium. <br><br></li><li><strong>Customize the appearance of your character and house. </strong> With hundreds of decorative items to choose from, you'll have no trouble creating the home of your dreams!<br><br></li><li><strong>Xbox controller support (with rumble)! (Keyboard still required for text input) </strong><br><br></li><li><strong>Over two hours of original music. </strong></li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/413150/header.jpg?t=1608624324","developer":"ConcernedApe","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2017,"age":0,"name":"Carcassonne - Tiles & Tactics","description":"New version of the muti-awarded game. Now in 3D. Includes improved IA, 3D landscape, new exclusive features.                                                                              <br />\r\n<br />\r\n*** Carcassonne fits that opening game niche that every game group needs. -Tyler Nichols, Board Game Quest<br />\r\n*** Carcassonne = Great game, great mechanics, great pieces, great fun! -The Board Game Family<br />\r\n*** Carcassonne's recent Android re-release and its fresh, new features are a joy to experience*** Pocket Gamer<br />\r\n<br />\r\nA TILE PLACEMENT GAME OF CREATING LANDSCAPES, CLAIMING AREAS, AND GAINING POINTS<br />\r\n<br />\r\nCarcassonne is a modern classic tile-placement game based on the award wining game in which the players draw and place a tile with a piece of southern French landscape on it. The tile might feature a city, a road, a cloister, grassland or some combination thereof, and it must be placed adjacent to tiles that have already been played, in such a way that cities are connected to cities, roads to roads, et cetera. The player can then decide to place one of his followers, so called Meeples, on one of the areas on it: on the city as a knight, on the road as a robber, on a cloister as a monk, or on the grass as a farmer. When that area is complete, that meeple scores points for its owner. Each new game is a new experience thanks to the ever-changing landscape.<br />\r\n<br />\r\nENJOY FUN AND TACTICAL GAMEPLAY<br />\r\n<br />\r\nDuring a game of Carcassonne, players are faced with decisions like: &quot;Is it really worth putting my last meeple there?&quot; or &quot;Should I use this tile to expand my city, or should I place it near my opponent instead, making it harder for him to complete his goal and score points?&quot; Since players place only one tile and have the option to place one meeple on it, turns proceed quickly even if it is a game full of options and possibilities.<br />\r\n<br />\r\nFEATURES<br />\r\n<br />\r\n• 5 expansions to shake up your games with new tiles, meeples and rules<br />\r\n• 1 Free expansion: The Abbot<br />\r\n• Solo mode<br />\r\n• Pass &amp; Play on the same device with your friends and family               <br />\r\n• Detection of blocked locations once the tile is placed.<br />\r\n• Online multiplayer mode includes:<br />\r\n- Public games to play with players all around the world <br />\r\n- Private games to invite your friends <br />\r\n- Ranked games and leaderboards<br />\r\n- Chat &amp; Lobby<br />\r\n• 3D modelisation (vs 2D for the previous versions and the physical game)<br />\r\n• Additional strategic layers compared to the physical version:<br />\r\n- field view which allows you to see the field possession of each player<br />\r\n- remaining tile list: allows you to see the tiles which are remaining in the draw pile<br />\r\n<br />\r\nLanguages available: English, French, German Italian, Spanish","image":"https://cdn.akamai.steamstatic.com/steam/apps/598810/header.jpg?t=1660751636","developer":"Artefacts","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2018,"age":0,"name":"Pandemic: The Board Game","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_02.png?t=1641489250\" /><br>Humanity is on the brink of extinction. As members of an elite disease control team, you’re the only thing standing in the way of the four deadly diseases spreading across the world. You must travel the globe protecting cities, containing infections from spreading, and discovering the cure for each disease. The fate of humanity is in your hands!<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/Pandemic_empty.gif?t=1641489250\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_04.png?t=1641489250\" /><br>You will assemble a team of specialists to save humankind. Each member of the team has their own set of skills that you must use efficiently.<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_06.png?t=1641489250\" /><br>Recruit the Medic to quickly treat diseases, discover a cure faster with the Scientist, or stop infections from spreading with the Quarantine Specialist. <br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_08.png?t=1641489250\" /><br>Each role opens new possibilities and syncs with the other roles to offer new strategies. Pick from seven available character roles to create your elite team.<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_10.png?t=1641489250\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_FT_EN.png?t=1641489250\" /><br><ul class=\"bb_ul\"><li>Choose your team from 7 different roles.<br></li><li>5 difficulty levels to change the game for newcomers and veterans alike.<br></li><li>Immersive theme, challenging gameplay, and replayability. Don’t play the same game twice!</li></ul><a href=\"https://steamcommunity.com/linkfilter/?url=https://www.facebook.com/AsmodeeDigital\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_14.png?t=1641489250\" /></a><br><a href=\"https://twitter.com/AsmodeeDigital\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_16.png?t=1641489250\" /></a><br><a href=\"https://steamcommunity.com/linkfilter/?url=https://account.asmodee.net/en/signup\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_18.png?t=1641489250\" /></a><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/622440/extras/20190924-pandemic_page-steam_19.png?t=1641489250\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/622440/header.jpg?t=1641489250","developer":"Asmodee Digital","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2018,"age":0,"name":"Scythe: Digital Edition","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/logo-scythe-animated.gif?t=1654678194\" /><br>In an alternate reality in 1920s Europa, it's been several years since the &quot;Great War&quot;, but the ashes of the conflict are still hot and the war is entering a new phase. The first conflict saw the emergence of some incredible engines of war known as Mechs. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/scythe-keyart.gif?t=1654678194\" /><br>Built by &quot;The Factory&quot;, an independent city-state which has since become the object of everyone's desire, these technological monstrosities roam the snowy landscapes of Europa. <br>Be the hero of one of the five factions – Saxony Empire, Crimean Khanate, Rusviet Union, Polania Republic or Nordic Kingdom – and become the richest and most powerful nation in all of Europa during these dark times! To assure the victory of your people, you will need to explore and conquer new territories, enlist new recruits and deploy your forces by building formidable and terrifying combat Mechs. Replay history in a fictional past full of mechanical engines and technology, where each choice you make will be critical. Choose your battles with care, because in Scythe, victory is achieved with and for the people!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/20190325-scythe-steam-newlook-factions.png?t=1654678194\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/main-features-EN.png?t=1654678194\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/features-EN.png?t=1654678194\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/gameplay-EN.png?t=1654678194\" /><br><br><ul class=\"bb_ul\"><li> Asymmetry: every player starts the game with different resources (energy, coins, keen combat sense, popularity…), a different starting location and a secret objective. The starting positions are specifically set to contribute to the uniqueness of every faction and the asymmetrical nature of the game.<br></li><li> Strategy: Scythe offers players almost complete control over their fate. The only elements of chance apart from each player's individual secrete objective card are the Encounter cards, which players draw to interact with the citizens of newly explored lands. Combat is also handled by way of choice; no luck or chance is involved.<br></li><li> Engine Building: Players can improve their construction abilities to become more efficient, build structures that improve their position on the map, enlist new recruits into their faction, activate mechs to dissuade opponents from invading and expand their borders to reap greater types and quantities of resources. This aspect creates a feeling of energy and progression over the course of the entire game. The order in which players get to develop their economy and technologies adds to the unique feel of every game, even when playing as the same faction several times.</li></ul><br><br><a href=\"https://steamcommunity.com/linkfilter/?url=https://www.facebook.com/AsmodeeDigital\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/Facebook-button-scythe.png?t=1654678194\" /></a><br><a href=\"https://twitter.com/AsmodeeDigital\" target=\"_blank\" rel=\"noreferrer\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/Twitter-Button.png?t=1654678194\" /></a><br><a href=\"https://steamcommunity.com/linkfilter/?url=https://account.asmodee.net/en/signup\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/Newsletter-Button.png?t=1654678194\" /></a><br><a href=\"https://steamcommunity.com/linkfilter/?url=https://discord.gg/Jkhz5TPZte\" target=\"_blank\" rel=\"noopener\"  ><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/718560/extras/20190124-scythe-steam-newlook_16.png?t=1654678194\" /></a>","image":"https://cdn.akamai.steamstatic.com/steam/apps/718560/header.jpg?t=1654678194","developer":"The Knights of Unity","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2018,"age":0,"name":"Paw Patrol: On A Roll!","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/758730/extras/PNG_Game_Features_1.png?t=1634313484\" /><br><br>No job is too big, no pup is too small! The PAW Patrol is ready to save the day in Adventure Bay on 16 exciting rescue missions, but they can only do it with your help! Help each pup use their unique abilities to rescue friends and keep their community safe. Jump into eight awesome Adventure Bay locations, including Farmer Yumi’s Farm, Jake’s Mountain, a desert canyon, under the waves, and more! Get ready for fun puzzle-platforming action that is PAWfect for kids of all ages with all the pups of the PAW Patrol! <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/758730/extras/Gif_1_Game_Features_1.gif?t=1634313484\" /><br><br>Features <br>• Ryder and all eight PAW Patrol pups, including Everest &amp; Tracker!<br>• 16 daring adventures set in 8 Adventure Bay locations!<br>• Special pup abilities that need to be used for each rescue!<br>• Playing as two different pups per mission!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/758730/extras/Gif_3_Game_Features_3.gif?t=1634313484\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/758730/header.jpg?t=1634313484","developer":"Torus Games","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2021,"age":0,"name":"Wildermyth","description":"Wildermyth is a character-driven, procedurally-generated tactical RPG. Like the best tabletop roleplaying experiences, Wildermyth gives you choices and answers your every decision with consequences that drive your characters forward. <br><br>Lead a band of heroes as they grow from reluctant farmers into unique, legendary fighters. Combat unexpected threats and strange monsters across interactive battlefields. Unravel mysteries and share pensive moments in an ever-new fantasy setting that blends hard truths and sacrifice with humor and personal storytelling.<br><br>Where does your myth lead? Come help us uncover it!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/763890/extras/heroLineup.png?t=1659543382\" /><br><ul class=\"bb_ul\"><li>Reminiscent of tabletop roleplaying, unique heroes are born in unique settings every game. They age, transform, fall in love, disagree, and make harrowing sacrifices. <br></li><li>Each hero brings their own organic history and personality with them, but your choices and combat skills are what decide their paths and outcomes. <br></li><li>All heroes die someday… but you get to hold on to your favorites. Reintroduce them in the next adventure, and over many lifetimes the myths you make will form your own legendary pantheon.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/763890/extras/heroesGorgonSmall.png?t=1659543382\" /><br><br><strong>An Imaginative Papercraft World</strong><br>The Yondering Lands, where the game is set, is a richly layered world populated with hand-painted 2D characters and scenery. We’ve paid loving attention to breaking molds and exploring new ideas: no orcs, elves, or goblins here—but watch out for the telepathic insect-dragons and the clockwork undead.<br><br><strong>Extreme Character Depth</strong><br>Each of your heroes has their own unique generated history, personality, and appearance, and will form relationships with your other heroes. All of these elements change and develop over the course of a playthrough, as characters age, encounter mysteries, and overcome challenges.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/763890/extras/heroesRelationshipSmall.png?t=1659543382\" /><br><br><strong>Choices That Matter</strong><br>Your hero may choose to trust the enigmatic wolf god, leading to a hair-raising change in their appearance and combat abilities. Or they may pursue a romance with a fellow hero, giving each of them a shared buff and more story opportunities. Encounters and events have permanent, character-defining effects, letting you craft the arc of each character.<br><br><strong>A New Approach to Death</strong><br>Did your favorite character get one-shotted by a tentacled horror-bear? Choose to let a hero &quot;fall back&quot; with a maiming that will lead to some transformative new paths in their legend, or let them go out in a blaze of glory to be remembered for generations to come.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/763890/extras/heroesDrauvenTower.png?t=1659543382\" /><br><br><strong>Deep and Creative Tactical Combat</strong><br>Combat in Wildermyth emphasizes teamwork and careful positioning, as well as imaginative use of your evolving capabilities and surroundings. Walling and Flanking mechanics provide clear but conflicting incentives, while mystical interfusion lets you remake the battlefield with explosive magic. Multiple difficulty levels mean you can get as intense as you want to.<br><br><strong>Cooperative Multiplayer</strong><br>In a multiplayer game, you and your friends can each customize and control your own heroes as you play through a campaign. Recommended for up to five players—though in a typical campaign, you start with three heroes and pick up the fourth and fifth along the way. We also support Steam Remote Play.<br><br><strong>Endless Replayability</strong><br>Pick and choose from a huge bank of combat abilities as your heroes level up in each playthrough, and decide whether you prefer offensive or defensive tactics, brute strength, stealth, or magically flinging fire from a nearby lamp into your enemies' faces. Procedural generation gives you new heroes, new enemies, new story events, and new maps every time you play.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/763890/extras/heroesMentor.png?t=1659543382\" /><br><br><strong>A Custom Pantheon of Legends</strong><br>You’ll have the freedom to customize hero appearances, names, histories, and more. As time passes, heroes grow old and may retire, or else might fall in combat—and yes, some will survive all the way to the end. You can add your favorite heroes to a roster of legends and call on them again in later playthroughs. Build your own mythologies and share the awe-inspiring might of your heroes with others.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/763890/header.jpg?t=1659543382","developer":"Worldwalker Games LLC","platforms":{"windows":true,"mac":true,"linux":true}},{"releaseYear":2018,"age":0,"name":"Terraforming Mars","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/logotfm.gif?t=1660753864\" /><h2 class=\"bb_tag\">The taming of the Red Planet has begun!</h2><br><br>Corporations are competing to transform Mars into a habitable planet by spending vast resources and using innovative technology to raise temperature, create a breathable atmosphere, and make oceans of water. As terraforming progresses, more and more people will immigrate from Earth to live on the Red Planet.<br>In Terraforming Mars, you control a corporation with a certain profile. Play project cards, build up production, place your cities and green areas on the map, and race for milestones and awards! <h2 class=\"bb_tag\">Will your corporation lead the way into humanity’s new era?</h2><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/20190927-terraforming_page-steam_02-min.png?t=1660753864\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/20190927-terraforming_page-steam_04-min.png?t=1660753864\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/20190927-terraforming_page-steam_06-min.png?t=1660753864\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/20190927-terraforming_page-steam_08-min.png?t=1660753864\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/800270/extras/20190927-terraforming_page-steam_09-min.png?t=1660753864\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/800270/header.jpg?t=1660753864","developer":"Twin Sails Interactive","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2021,"age":0,"name":"Arkham Horror: Mother's Embrace","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/840210/extras/20190719-arkham-page-steam_02.jpg?t=1660751301\" /><br>Inspired by the award-winning board game franchise, Arkham Horror: Mother’s Embrace is an investigation game served with turn-based combat, set in the haunted worlds of H.P. Lovecraft’s Cthulhu mythos. Plunge into an original story written by Fantasy Flight Interactive’s official writers and explore the American Roaring Twenties.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/840210/extras/20190719-arkham-page-steam_04-min.png?t=1660751301\" /><br>The year is 1926: a professor of astronomy is found dead in her mansion and everything indicates that she has been the victim of a heinous murder. Choose from 12 intrepid investigators from the Arkham Horror games, each with a unique set of skills, and assemble your team to shed the light over this mysterious death.<br><br>Find clues, perform interrogations and progress through nine chapters as the story unfolds. Your investigation will take you to visit shadowed institutions and mysterious locales, ranging from Miskatonic University, the Arkham Asylum, and the bayous of Louisiana. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/840210/extras/20190719-arkham-page-steam_06-min-v2.png?t=1660751301\" /><br>As the investigators get closer to their goal, your squad will have to face curious science, living nightmares, and a sinister cult, whose mad scheme is to bring about the end of everything. Use a large variety of melee and ranged weapons, as well as powerful items and devastating magic spells to defeat your opponents in turn-based combat; while you attempt to retain your sanity.<br><br>As you face off against Lovecraftian horrors, your investigators will descend deeper into the depths of madness, affecting their level of sanity and causing traumas that will impact the course of your investigation. Care about your sanity and make the right choices… the Ancient Ones are preparing their return.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/840210/extras/20190719-arkham-page-steam_08-min-v2.png?t=1660751301\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/840210/header.jpg?t=1660751301","developer":"Twin Sails Interactive","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2021,"age":0,"name":"Valheim","description":"<strong>Valheim </strong>is a brutal exploration and survival game for 1-10 players set in a procedurally-generated world inspired by Norse mythology. Craft powerful weapons, construct longhouses, and slay mighty foes to prove yourself to Odin!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/892970/extras/VALHEIM_EXPLORE.gif?t=1647939640\" /><br><strong>EXPLORE THE TENTH WORLD</strong><br>Explore a world shrouded in mystery. Discover distinct environments with unique enemies to battle, resources to gather and secrets to uncover! Be a viking, sail the open seas in search of lands unknown, and fight bloodthirsty monsters.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/892970/extras/VALHEIM_BUILD.gif?t=1647939640\" /><br><strong>BUILD MIGHTY HALLS</strong><br>Raise viking longhouses and build bases that offer reprieve from the dangers ahead. Customise buildings, both inside and out, with a detailed building system. Progress through building tiers to upgrade, expand and defend your base.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/892970/extras/VALHEIM_CRAFT_SURVIVE.gif?t=1647939640\" /><br><strong>GATHER, CRAFT AND SURVIVE</strong><br>Struggle to survive as you gather materials and craft weapons, armor, tools, ships, and defenses. Decorate your hearths and sharpen your blades, grow crops and vegetables, prepare food, brew meads and potions, and progress as you defeat more difficult bosses and discover new recipes and blueprints.<br><br><strong>KEY FEATURES:</strong><br><ul class=\"bb_ul\"><li>Massive procedurally-generated world where every biome is immersive and distinct, with unique enemies, resources and crafting recipes to discover.<br></li><li>Play alone or with up to 10 players on player-hosted dedicated servers and experience unlimited world creation and enemies that scale in difficulty.<br></li><li>Staminabased combat that rewards preparation and skill. Utilize weapon types with unique attacks, different blocking styles, ranged combat, dodges and parries to fight your enemies.<br></li><li>Rewarding food system where you cannot starve and are not punished for not eating, instead you gain health, stamina and regeneration buffs depending on what foods you consume.<br></li><li>Intuitive crafting where recipes are discovered as you explore the world, and pick up new resources and ingredients.<br></li><li>Flexible building system that takes structural integrity and ventilation into account. Build a small shelter or an entire village, make outposts or claim abandoned buildings as your own. Then customize to your liking.<br></li><li>Sail boats and ships to reach distant lands and explore the sea that offers riches to claim and monsters to fight.<br></li><li>Epic boss fights that will test even the best prepared vikings and offer rewards that help you on your journey.<br><br><strong>Community-translated languages:</strong><br>In addition to the officially supported languages, Valheim has several community-translated languages. As the name would suggest these are all translated by fans and members of the community, and is an ongoing process. <strong>We can't guarantee the quality nor completeness of any specific translation effort.</strong></li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/892970/header.jpg?t=1647939640","developer":"Iron Gate AB","platforms":{"windows":true,"mac":false,"linux":true}},{"releaseYear":2019,"age":0,"name":"DreamWorks Dragons: Dawn of New Riders","description":"A new heroic dragon and rider are taking to the skies and only you can help them defeat the evil villains who destroyed a dragon sanctuary created by Hiccup and Toothless. When the island of Havenholme is found in ruins, mysterious survivors emerge as unlikely future heroes.  Scribbler is a scholar who cannot remember his past while Patch is a unique breed of dragon, a “chimeragon,” who harnesses new, unexpected powers they both discover along the way. Together they must explore new islands, battle fierce enemies, and piece together lost memories that will reveal the strange truth about Patch’s origin and why the villain, Eir, will stop at nothing to recapture him.<br />\r\n<br />\r\nPrepare for a story of fire and friendship that you won’t forget. Meet your favorite DreamWorks Dragons characters like Hiccup, Astrid, Gobber and more. Complete quests in locations like Valka’s Mountain, alongside a host of newly discovered islands, such as Blood Briar Island. Go up against fearsome boss dragons and defeat the Dragon Trappers who will stop at nothing to capture Patch.  Unlock more of Patch’s incredible hidden abilities to free captured dragons and stop Eir from carrying out her evil plans.  Throughout your adventure, you’ll discover there’s one thing even stronger than the ultimate chimeragon: the bond between a dragon and its rider.<br />\r\n<br />\r\n•\tA NEW ADVENTURE: Recover Scribbler’s lost memories as you forge a friendship with Patch, his ultimate hybrid dragon<br />\r\n•\tBATTLE: Unlock powerful abilities and take on fearsome foes<br />\r\n•\tEXPLORE: Fly to new and familiar locations including Havenholme, Valka’s Mountain and Blood Briar Island <br />\r\n•\tSOLVE PUZZLES: Swap between Scribbler and his dragon Patch to conquer obstacles","image":"https://cdn.akamai.steamstatic.com/steam/apps/896960/header.jpg?t=1615481165","developer":"Climax Studios Ltd.","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2018,"age":0,"name":"Love Letter","description":"DRAW, PLAY AND BLUFF, FOR ONLY ONE SUITOR WILL BE ABLE TO WIN THE HEART OF THE PRINCESS<br><br>You and other suitors are prepared to do anything to get your love letter to the princess. She's shut herself inside her palace, so you're forced to use go-betweens to deliver the message. Guards, princes, the king, the countess... Who will turn out to be the best ally to help win your beloved's heart?<br><br>You only ever have two cards in your hand. Draw and play your cards to get closer to the princess. Everyone staying in the castle could aid you in their own way: guards and princes can help discredit letters from other suitors, priests will give you precious information about your rivals while the handmaiden will protect your letter at any cost! <br><br>As the game progresses, you'll have to think strategically, bluff and try to read your opponents' game. When the deck is used up, the card in your hand will be the character holding your letter for the princess. The strongest card, i.e. the character who's closest to the princess, wins!<br>Send the other suitors packing, gain the advantage and win the game. Let's get started!<h2 class=\"bb_tag\">Features:</h2><ul class=\"bb_ul\"><li>Simple rules and quick turns in this game adapted from the multi-award winning card game Love Letter<br></li><li>1 to 4 players<br></li><li>Play in single-player mode against the computer, against your friends in private multiplayer or face suitors from all over the world in online mode<br></li><li>16 cards representing 8 types of characters found at the Court: Guards, Priests, Barons, Handmaidens, Princes, King, Countess and of course the Princess</li></ul><br><br>Available languages: French, English, Spanish, Italian, German, Japanese, Simplified Chinese, Russian.","image":"https://cdn.akamai.steamstatic.com/steam/apps/926520/header.jpg?t=1660752532","developer":"Nomad Games","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2018,"age":0,"name":"Among Us","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/945360/extras/steam_AboutBanner_copy.png?t=1646296970\" /><br><br>Play with 4-15 player online or via local WiFi as you attempt to prepare your spaceship for departure, but beware as one or more random players among the Crew are Impostors bent on killing everyone!<br><br>Originally created as a party game, we recommend playing with friends at a LAN party or online using voice chat. Enjoy cross-platform play between Android, iOS, Nintendo Switch, and PC. Coming soon to Xbox and PlayStation, which will also feature crossplay. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/945360/extras/steam_AboutCrew_copy.png?t=1646296970\" /><br><ul class=\"bb_ul\"><li> Win by completing tasks to prepare the ship or ejecting all Impostors.<br></li><li> React quickly to undo the Impostor's sabotages.<br></li><li> Check the Admin map and Security cameras to keep tabs on other Crewmates.<br></li><li> Report any dead bodies immediately to start discussion of who the suspected Impostor is.<br></li><li> Call emergency meetings to discuss suspicious behavior.<br></li><li> Vote to eject suspected Impostors.</li></ul><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/945360/extras/steam_AboutImpostor_copy.png?t=1646296970\" /><br><ul class=\"bb_ul\"><li> Kill crewmates and frame bystanders.<br></li><li> Pretend to run tasks to blend in with the crewmates.<br></li><li> Sneak through the vents to quickly move about the ship.<br></li><li> Use sabotages to cause chaos and divide the crew.<br></li><li> Close doors to trap victims and kill in private.</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/945360/extras/steam_AboutMultiPlay.png?t=1646296970\" /><h2 class=\"bb_tag\">Features</h2><ul class=\"bb_ul\"><li> Customization: Pick your color, hat, skin, and pet.<br></li><li> Lots of game options: Add more Impostors, more tasks, and so much more!<br></li><li> 4 different maps to play in: The Skeld, MIRA HQ, Polus, and the Airship.<br></li><li> Quickly find a game online from the host list.<br></li><li> In-game text chat.<br></li><li> Rich Discord integration.<br></li><li> Cross-platform play between PC, Android, and iOS!</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/945360/header.jpg?t=1646296970","developer":"Innersloth","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2020,"age":0,"name":"A Game of Thrones: The Board Game - Digital Edition","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_02.png?t=1660749294\" /><br><strong>A Game of Thrones: The Board Game – Digital Edition</strong> is the digital adaptation of the top-selling strategy board game from Fantasy Flight Games. During the game, players spread their influence across Westeros through a combination of strategic planning, masterful diplomacy, and military might. As one of the Great Houses, will you conquer with force, forge alliances, rally your townsfolk, or cunningly coerce your way to the Iron Throne?<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_04.png?t=1660749294\" /><br>Based on the best-selling A Song of Ice and Fire series of fantasy novels by George R.R. Martin, A Game of Thrones: The Board Game – Digital Edition  allows up to six players to play online, or a single player with up to five AI opponents to play locally. The game is set after the death of King Robert Baratheon and allows each player to assume the role of one of the Great Houses of the Seven Kingdoms in an attempt to assault King’s Landing and claim the Iron Throne.<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_06.png?t=1660749294\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_07.png?t=1660749294\" /><br>To be declared ruler of the Seven Kingdoms, you have 10 rounds to use diplomacy and warfare to your advantage to control as many strategic areas of the map.<br>Conquer with care as your resources are scarce and your troops are not expendable.  Muster your army, plan your orders wisely and seize strategical lands with your Footmen, Knights, Siege Engine and ships. <br>During the turmoil of a battle, use well-known characters from your house to take the upper hand and vanquish your enemies.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/GOT_battle_v2.gif?t=1660749294\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_10.png?t=1660749294\" /><br><strong>A Game of Thrones: The Board Game – Digital Edition</strong> is a game of negotiation and deception.<br>Each round, you secretly assign one order token to each of your armies: promise support, offer peace, forge alliances, betray a vulnerable ally - a House that dares set its eyes on the Iron Throne must turn many wheels within wheels to achieve its ends.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/GOT_reveal_v2.gif?t=1660749294\" /><br><br>Move up the three influence tracks by betting your hard-earned power tokens. Obtain the Iron Throne, the Messenger Raven and the Valyrian steel tokens, each granting you strategic and social gameplay advantages to hold sway over rival houses. <br>However, keep an eye beyond the Wall as an army of barbaric wildlings gather to descend upon the continent! All houses must cooperate to gather enough power tokens to reinforce the Night’s Watch and fend off the wildlings, or the consequences could be devastating…<br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1075190/extras/20191007-GOT-page-steam_11.png?t=1660749294\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/1075190/header.jpg?t=1660749294","developer":"Dire Wolf","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2019,"age":0,"name":"STAR WARS Jedi: Fallen Order™","description":"A galaxy-spanning adventure awaits in <i>Star Wars Jedi: Fallen Order</i>, a new third-person action-adventure title from Respawn Entertainment. This narratively driven, single-player game puts you in the role of a Jedi Padawan who narrowly escaped the purge of Order 66 following the events of Episode 3: Revenge of the Sith. On a quest to rebuild the Jedi Order, you must pick up the pieces of your shattered past to complete your training, develop new powerful Force abilities and master the art of the iconic lightsaber - all while staying one step ahead of the Empire and its deadly Inquisitors.<br><br>While mastering your abilities, players will engage in cinematically charged lightsaber and Force combat designed to deliver the kind of intense Star Wars lightsaber battles as seen in the films. Players will need to approach enemies strategically, sizing up strengths and weaknesses while cleverly utilizing your Jedi training to overcome your opponents and solve the mysteries that lay in your path.<br><br>Star Wars fans will recognize iconic locations, weapons, gear and enemies while also meeting a roster of fresh characters, locations, creatures, droids and adversaries new to Star Wars. As part of this authentic Star Wars story, fans will delve into a galaxy recently seized by the Empire. As a Jedi hero-turned-fugitive, players will need to fight for survival while exploring the mysteries of a long-extinct civilization all in an effort to rebuild the remnants of the Jedi Order as the Empire seeks to erase the Jedi completely.<h2 class=\"bb_tag\"><strong>KEY FEATURES</strong></h2><ul class=\"bb_ul\"><li><strong>Cinematic, Immersive Combat</strong> – Jedi: Fallen Order delivers the fantasy of becoming a Jedi through its innovative lightsaber combat system–striking, parrying, dodging–partnered with a suite of powerful Force abilities you’ll need to leverage to overcome obstacles that stand in your way. This combat system is intuitive but takes training and practice to fully master its nuances as you gain new powers and abilities along your adventure.<br></li><li><strong>A New Jedi Story Begins</strong> - As a former Padawan on the run from the Empire, you must complete your training before Imperial Inquisitors discover your plan to revive the Jedi Order. Aided by a former Jedi Knight, a cantankerous pilot and a fearless droid, you must escape the evil machinations of the Empire in a story-driven adventure. Explore and overcome a wide range of challenges focused on combat, exploration and puzzle-solving.<br></li><li><strong>The Galaxy Awaits</strong> - Ancient forests, windswept rock faces and haunted jungles are all unique biomes you’ll explore in Jedi: Fallen Order, with the freedom to decide when and where you go next. As you unlock new powers and abilities, opportunities open up to re-traverse maps in new ways; leveraging the Force to augment the way you explore. Move quickly, however, as the Empire is actively hunting your every step in their effort to exterminate all remnants of the Jedi Order.</li></ul>","image":"https://cdn.akamai.steamstatic.com/steam/apps/1172380/header.jpg?t=1651767465","developer":"Respawn Entertainment","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2020,"age":0,"name":"PAW Patrol Mighty Pups Save Adventure Bay","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/PPMP_Call_out_01_Steam.png?t=1656003632\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/Gif_2_Game_Features_2.gif?t=1656003632\" /><br><br>A fallen meteor has given the pups mighty powers – and left Adventure Bay in a mighty mess. Now it’s up to you and the Pups to use their powers, rescue skills and gadgets to make the town PAWsome again!<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/PPMP_Call_out_02_Steam.png?t=1656003632\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/Gif_1_Game_Features_1.gif?t=1656003632\" /><br><br>Embark on super-heroic missions with the Mighty Pups and Chase’s Super Speed, Marshall’s Mighty Heat, Skye’s Whirlwind Power and the whole mighty PAW Patrol team. Explore the town and journey to Jake’s snowboarding resort, Tracker’s jungle and beyond, as you work together to rescue friends. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/PPMP_Call_out_03_Steam.png?t=1656003632\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1374990/extras/Gif_3_Game_Features_3.gif?t=1656003632\" /><br><br>So, head to the Lookout and get ready for Mighty action! After you’re done saving the day, get playful with Pup -Pup Boogie, jump rope and more fun activities side-quests. And bring a friend along in 2-player co-op mode. Mighty Pups, GO!","image":"https://cdn.akamai.steamstatic.com/steam/apps/1374990/header.jpg?t=1656003632","developer":"DRAKHAR STUDIO","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2020,"age":0,"name":"Blood Rage: Digital Edition","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/20191222-BloodRage-page-steam_02.jpg?t=1660751382\" /><br><br><strong>Ragnarök is coming!</strong> The sky is falling and the end is upon you…<br>In Blood Rage, the digital adaptation of the <strong>hit strategy board game</strong>, you <strong>lead a proud Viking clan</strong> in their <strong>final fight</strong> for glory and the right of <strong>passage to Valhalla</strong> before the world finally comes to its fiery conclusion.<br>Take command of your warriors, pillage villages, make good use of gifts from the gods and conquer your place with Odin in Valhalla.<br><strong>Life is fleeting, but glory is eternal. Now is the time for rage!</strong><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/20191222-BloodRage-page-steam_06.png?t=1660751382\" /><br><br>Created by acclaimed designer Eric Lang (Rising Sun, Arcadia Quest, Chaos in the Old World), Blood Rage lets you <strong>lead one of the seven ancient Viking clans</strong>: The Wolf, Bear, Serpent, Raven, Ram, Wild Boar and Stag clan. <strong>Each with their own unique miniatures</strong> of warriors and leaders. <br>In Blood Rage, your <strong>goal is to achieve the greatest amount of glory</strong> before the end of the third and final age—and the arrival of Ragnarök. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/20191222-BloodRage-page-steam_08.jpg?t=1660751382\" /><br><br>Each god is generous in their own way: Frigga provides resources and support, Tyr strengthens your clan in battle while Loki rewards losing battles or punishes the opposing winner. <br><br><strong>Drafting gifts</strong> from a god will determine the strategy you want to implement. Choose your cards wisely or deprive your opponents of precious gifts. <br><br>For your clan, there are <strong>many paths to Glory</strong>: <br>•\t<strong>Invade </strong>the mythical land of Midgard and its nine provinces, pillaging their villages and the province of Yggdrasil. <br>•\t<strong>Crush </strong>other clans in ferocious battles and encounter legendary creatures from Norse mythology. <br>•\t<strong>Fulfill </strong>quests in honor of the mighty gods. <br>•\t<strong>Die </strong>gloriously in battle or from Ragnarök as any Viking was born to do. <br>•\tThe <strong>only losing strategy</strong> in Blood Rage is to <strong>cower from combat</strong>.  <br><br>Earning your place to Valhalla in single-player mode is glorious. Eternal triumph, however, can only be achieved by reaching the top of the leaderboard in <strong>ranked online multiplayer</strong>. <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/BR_battle_v2.gif?t=1660751382\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/20191222-BloodRage-page-steam_10.png?t=1660751382\" /><br><br><ul class=\"bb_ul\"><li><strong>Fight to gain entry to Valhalla</strong>: Pillage, fight, sacrifice… Experience a new type of strategy game where victory can only be achieved by commanding your warriors in the field of battle in the face of final doom. <br></li><li><strong>Welcome to Midgard</strong>: Dozens of 3d scanned miniatures and a dynamic board faithful to the original boardgame. <br></li><li><strong>Multi-layered strategy game</strong>: Blood Rage mixes draft, hidden cards, resource management and its sheer load of trickery. Plan your strategy but be ready to adapt to your opponents’ choices: winning battles is not always the best course of action. <br></li><li><strong>Up to five Players</strong>: Introducing the ‘5th player expansion’ giving the options to play up to five players. All the miniatures from the Ram, Wild Boar and Stag clans as well as the God Gifts cards from the ‘5th Player Expansion’ of the board game are available in this digital edition for free. <br></li><li><strong>Become the greatest Viking Leader</strong>: Play solo against AI, local multi-player via hotseat or online multiplayer with ELO ranking and leaderboards.</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/BR-page-steam-Giants_1.gif?t=1660751382\" /><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1015930/extras/20191222-BloodRage-page-steam_11.png?t=1660751382\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/1015930/header.jpg?t=1660751382","developer":"Endava","platforms":{"windows":true,"mac":true,"linux":false}},{"releaseYear":2021,"age":0,"name":"My Friend Peppa Pig","description":"<img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1635590/extras/Peppa_EN_PlayerBanner_Top_615x54.png?t=1660812488\" /><br><br>Have a fun-filled adventure by becoming Peppa Pig’s new friend! <br><br>Create and dress your character, ring Peppa’s doorbell, and begin a story that’s all up to you Peppa suggests activities everywhere you go – help Daddy Pig find his glasses, follow the animal tracks in the Forest, splash in muddy puddles, and much more! It’s just like being in an episode of the TV show, where all your favorite characters are excited to meet you. From the Beach to the Museum and even Potato City, every playtime is a new experience with your friend Peppa Pig.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1635590/extras/Peppa_Pig_03.gif?t=1660812488\" /><br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1635590/extras/Peppa_EN_PlayerBanner_Bottom_615x54.png?t=1660812488\" /><br><br><ul class=\"bb_ul\"><li>PARENTAL CONTROL – Easily set a time limit in Settings. Peppa ends the game when playtime is over<br></li><li>BUILD YOUR CHARACTER – Choose and dress your avatar<br></li><li>PLAY WITH PEPPA – Learn and adventure with your new friend<br></li><li>EXPLORE HER WORLD – Visit the beach , the Forest, Potato City and beyond<br></li><li>MAKE FRIENDS – Your favorite Peppa Pig characters want to meet you<br></li><li>GET CREATIVE – Young players star in their own unique story</li></ul><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1635590/extras/Peppa_Pig_02.gif?t=1660812488\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/1635590/header.jpg?t=1660812488","developer":"Petoons Studio","platforms":{"windows":true,"mac":false,"linux":false}},{"releaseYear":2022,"age":0,"name":"Dungeon Alchemist","description":"Ever felt uninspired, technically challenged or just bored when creating your game maps? Dungeon Alchemist is AI-powered Fantasy Game Mapmaking Software that enables you to make high-quality content fast! Simply pick a theme, start drawing, and Dungeon Alchemist creates high-quality maps you can print, share, or use in your favourite Virtual Tabletop Application. It uses an AI algorithm to place walls, floors, objects and lighting, so you can focus on being creative.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1588530/extras/DrawEntireDungeon-Faster.gif?t=1661517530\" /><h2 class=\"bb_tag\">PICK A THEME</h2><br>Dungeon Alchemist comes jam-packed full of exciting and inspiring objects and settings. Start your mapmaking adventure by picking one of our themes.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1588530/extras/DungeonAlchemist-Themegraphic-0503.png?t=1661517530\" /><h2 class=\"bb_tag\">MAKE THE MAP OF YOUR DREAMS</h2><br>With just a few clicks, Dungeon Alchemist will conjure a beautiful landscape that will inspire you and your players. You choose the theme of each room, and Dungeon Alchemist will do the rest. Don't like what you get? Just press the randomize button and Dungeon Alchemist's AI algorithm will generate ever new rooms for you.<br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1588530/extras/smithy.gif?t=1661517530\" /><h2 class=\"bb_tag\">TWEAK UNTIL IT'S JUST RIGHT</h2><br>Once the AI algorithm has done its job, you can tweak the map to your heart's content. Add, scale, remove and rotate objects, move doors, change floor tiles and so much more! <br><br><img src=\"https://cdn.akamai.steamstatic.com/steam/apps/1588530/extras/manipulate-objects.gif?t=1661517530\" />","image":"https://cdn.akamai.steamstatic.com/steam/apps/1588530/header.jpg?t=1661517530","developer":"Briganti","platforms":{"windows":true,"mac":true,"linux":true}}]
